[{"UID":"7","presentation_id":"38929846","speakers":"Tovly Deutsch (Masoud Jasbi, Stuart Shieber)","title":"Linguistic Features for Readability Assessment"},{"UID":"8","presentation_id":"38929847","speakers":"Anastassia Loukina (Nitin Madnani, Aoife Cahill, Lili Yao, Matthew S. Johnson, Brian Riordan, Daniel F. McCaffrey)","title":"Using PRMSE to Evaluate Automated Scoring Systems in the Presence Of Label Noise "},{"UID":"28","presentation_id":"38929849","speakers":"Scott Hellman (William Murray, Adam Wiemerslage, Mark Rosenstein, Peter Foltz, Lee Becker, Marcia Derr)","title":"Multiple Instance Learning for Content Feedback Localization without Annotation "},{"UID":"31","presentation_id":"38929850","speakers":"Vatsal Raina (Mark Gales, Kate Knill)","title":"Complementary Systems for Off-topic Spoken Response Detection "},{"UID":"18","presentation_id":"38929855","speakers":"Katherine Stasaski (Kimberly Kao, Marti A. Hearst)","title":"CIMA: A Large Open Access Dialogue Dataset for Tutoring "},{"UID":"29","presentation_id":"38929858","speakers":"Daniel Wiechmann (Elma Kerz, Yu Qiao, Marcus Ströbel)","title":"Becoming Linguistically Mature: Modeling English and German Children’s Writing Development Across School Grades "},{"UID":"20","presentation_id":"38929856","speakers":"Tazin Afrin (Elaine Lin Wang, Diane Litman, Lindsay Clare Matsumura, Richard Correnti)","title":"Annotation and Classification of Evidence and Reasoning Revisions in Argumentative Writing"},{"UID":"35","presentation_id":"38929859","speakers":"Sandeep Mathias (Pushpak Bhattacharyya)","title":"Can Neural Networks Automatically Score Essay Traits? "},{"UID":"22","presentation_id":"38929857","speakers":"Alessio Miaschi (Sam Davidson, Dominique Brunato, Felice Dell'Orletta, Kenji Sagae, Claudia Helena Sanchez-Gutierrez, Giulia Venturi)","title":"Tracking the Evolution of Written Language Competence in L2 Spanish Learners "},{"UID":"44","presentation_id":"38929863","speakers":"Lingyu Gao (Kevin Gimpel, Arnar Jensson)","title":"Distractor Analysis and Selection for Multiple-Choice Cloze Questions for Second-Language Learners "},{"UID":"1","presentation_id":"38929853","speakers":"Samuel González-López (Steven Bethard, Aurelio Lopez-Lopez)","title":"Assisting Undergraduate Students in Writing Spanish Methodology Sections"},{"UID":"3","presentation_id":"38929845","speakers":"Hanna Suominen (Zara Maxwelll-Smith, Simón González Ochoa, Ben Foley)","title":"Applications of Natural Language Processing in Bilingual Language Teaching: An Indonesian-English Case Study "},{"UID":"36","presentation_id":"38929852","speakers":"Brian Riordan (Sarah Bichler, Allison Bradford, Jennifer King Chen, Korah Wiley, Libby Gerard, Marcia C. Linn)","title":"An Empirical Investigation of Neural Methods for Content Scoring of Science Explanations "},{"UID":"19","presentation_id":"38929848","speakers":"Debanjan Ghosh (Beata Beigman Klebanov, Yi Song)","title":"An Exploratory Study of Argumentative Writing by Young Students: A transformer-based Approach "},{"UID":"32","presentation_id":"38929851","speakers":"Elijah Mayfield (Alan W Black)","title":"Should You Fine-Tune BERT for Automated Essay Scoring? "},{"UID":"9","presentation_id":"38929854","speakers":"Kostiantyn Omelianchuk, Vitaliy Atrasevych, Artem Chernodub, Oleksandr Skurzhanskyi","title":"GECToR – Grammatical Error Correction: Tag, Not Rewrite "},{"UID":"51","presentation_id":"38929865","speakers":"Yo Ehara","title":"Interpreting Neural CWI Classifiers' Weights as Vocabulary Size "},{"UID":"50","presentation_id":"38929864","speakers":"Yiyi Wang (Emily Prud'hommeaux, Meysam Asgari, Jill Dolata)","title":"Automated Scoring of Clinical Expressive Language Evaluation Tasks "},{"UID":"40","presentation_id":"38929860","speakers":"Aoife Cahill (James H Fife, Brian Riordan, Avijit Vajpayee, Dmytro Galochkin)","title":"Context-based Automated Scoring of Complex Mathematical Responses "},{"UID":"41","presentation_id":"38929861","speakers":"Victoria Yaneva (Kang Xue, Christopher Runyon, Peter Baldwin)","title":"Predicting the Difficulty and Response Time of Multiple Choice Questions Using Transfer Learning "},{"UID":"42","presentation_id":"38929862","speakers":"Alla Rozovskaya (Max White)","title":"A Comparative Study of Synthetic Data Generation Methods for Grammatical Error Correction "}]
