[{"UID":"1","presentation_id":"38929767","speakers":"Zihan Liu, Genta Indra Winata and Pascale Fung","title":"Zero-Resource Cross-Domain Named Entity Recognition"},{"UID":"2","presentation_id":"38929768","speakers":"Tyler A. Chang and Anna Rafferty","title":"Encodings of Source Syntax: Similarities in NMT Representations Across Target Languages"},{"UID":"3","presentation_id":"38929769","speakers":"Mingda Chen and Kevin Gimpel","title":"Learning Probabilistic Sentence Representations from Paraphrases"},{"UID":"12","presentation_id":"38929770","speakers":"Siddharth Bhat, Alok Debnath, Souvik Banerjee and Manish Shrivastava","title":"Word Embeddings as Tuples of Feature Probabilities"},{"UID":"13","presentation_id":"38929771","speakers":"Abhinav Gupta, Cinjon Resnick, Jakob Foerster, Andrew Dai and Kyunghyun Cho","title":"Compositionality and Capacity in Emergent Languages"},{"UID":"15","presentation_id":"38929772","speakers":"Pratik Jawanpuria, Satya Dev N T V, Anoop Kunchukuttan and Bamdev Mishra","title":"Learning Geometric Word Meta-Embeddings"},{"UID":"20","presentation_id":"38929773","speakers":"Ivan Vulić, Anna Korhonen and Goran Glavaš","title":"Improving Bilingual Lexicon Induction with Unsupervised Post-Processing of Monolingual Word Vector Spaces"},{"UID":"22","presentation_id":"38929774","speakers":"Lis Pereira, Xiaodong Liu, Fei Cheng, Masayuki Asahara and Ichiro Kobayashi","title":"Adversarial Training for Commonsense Inference"},{"UID":"28","presentation_id":"38929775","speakers":"Riccardo Volpi and Luigi Malagò ","title":"Evaluating Natural Alpha Embeddings on Intrinsic and Extrinsic Tasks"},{"UID":"29","presentation_id":"38929776","speakers":"Ashutosh Adhikari, Achyudh Ram, Raphael Tang, William L. Hamilton and Jimmy Lin","title":"Exploring the Limits of Simple Learners in Knowledge Distillation for Document Classification with DocBERT"},{"UID":"30","presentation_id":"38929777","speakers":"Cemil Cengiz and Deniz Yuret","title":"Joint Training with Semantic Role Labeling for Better Generalization in Natural Language Inference"},{"UID":"33","presentation_id":"38929778","speakers":"Juan Manuel Coria, Sahar Ghannay, Sophie Rosset and Hervé Bredin","title":"A Metric Learning Approach to Misogyny Categorization"},{"UID":"34","presentation_id":"38929779","speakers":"Lukas Lange, Heike Adel and Jannik Strötgen","title":"On the Choice of Auxiliary Languages for Improved Sequence Tagging"},{"UID":"35","presentation_id":"38929780","speakers":"Lukas Lange, Anastasiia Iurshina, Heike Adel and Jannik Strötgen","title":"Adversarial Alignment of Multilingual Models for Extracting Temporal Expressions from Text"},{"UID":"36","presentation_id":"38929781","speakers":"Alessio Miaschi and Felice Dell'Orletta","title":"Contextual and Non-Contextual Word Embeddings: an in-depth Linguistic Investigation"},{"UID":"38","presentation_id":"38929782","speakers":"Shijie Wu and Mark Dredze","title":"Are All Languages Created Equal in Multilingual BERT?"},{"UID":"41","presentation_id":"38929783","speakers":"Martin Tutek and Jan Snajder","title":"Staying True to Your Word: (How) Can Attention Become Explanation?"},{"UID":"42","presentation_id":"38929784","speakers":"Mitchell Gordon, Kevin Duh and Nicholas Andrews","title":"Compressing BERT: Studying the Effects of Weight Pruning on Transfer Learning"},{"UID":"44","presentation_id":"38929785","speakers":"Vikas Raunak, Vaibhav Kumar, Vivek Gupta and Florian Metze","title":"On Dimensional Linguistic Properties of the Word Embedding Space"},{"UID":"48","presentation_id":"38929786","speakers":"Shubham Toshniwal, Haoyue Shi, Bowen Shi, Lingyu Gao, Karen Livescu and Kevin Gimpel","title":"A Cross-Task Analysis of Text Span Representations"},{"UID":"49","presentation_id":"38929787","speakers":"Yuhui Zhang, Chenghao Yang, Zhengping Zhou and Zhiyuan Liu","title":"Enhancing Transformer with Sememe Knowledge"},{"UID":"50","presentation_id":"38929788","speakers":"Hanoz Bhathena, Angelica Willis and Nathan Dass","title":"Evaluating Compositionality of Sentence Representation Models"},{"UID":"54","presentation_id":"38929789","speakers":"Aditya Bhargava and Gerald Penn","title":"Supertagging with CCG primitives"},{"UID":"56","presentation_id":"38929790","speakers":"Sriram Balasubramanian, Naman Jain, Gaurav Jindal, Abhijeet Awasthi and Sunita Sarawagi","title":"What's in a Name? Are BERT Named Entity Representations just as Good for any other Name?"},{"UID":"W1005","presentation_id":"38931233","speakers":"Satwik Bhattamishra, Kabir Ahuja and Navin Goyal","title":"On the Ability of Self-Attention Networks to Recognize Counter Languages"},{"UID":"W1006","presentation_id":"38931234","speakers":"Edison Marrese-Taylor, Machel Reid and Yutaka Matsuo","title":"Variational Inference for Learning Representations of Natural Language Edits"},{"UID":"W1007","presentation_id":"38931235","speakers":"Amber Nigam, Pragati Jaiswal, Teertha Arora, Uma Girkar and Leo Anthony Celi","title":"Predicting Sexual and Reproductive Health of Migrants using Data Science"},{"UID":"W1008","presentation_id":"38931236","speakers":"Amber Nigam, Aakash Roy, Hartaran Singh and Arpan Saxena","title":"Job Recommendation through Progression of Job Selection"},{"UID":"W1009","presentation_id":"38931237","speakers":"Pratik Jawanpuria, Mayank Meghwanshi and Bamdev Mishra","title":"A Simple Approach to Learning Unsupervised Multilingual Embeddings"},{"UID":"W1010","presentation_id":"38931238","speakers":"Anoop Kunchukuttan, Divyanshu Kakwani, Satish Golla, Gokul N.C., Avik Bhattacharyya, Mitesh M. Khapra and Pratyush Kumar","title":"AI4Bharat-IndicNLP Dataset: Monolingual Corpora and Word Embeddings for Indic Languages: Monolingual Corpora and Word Embeddings for Indic Languages"},{"UID":"W1001","presentation_id":"38929791","speakers":"Kristina Toutanova","title":"Invited Talk 1"},{"UID":"W1002","presentation_id":"38929792","speakers":"Ellie Pavlick","title":"Invited Talk 2"},{"UID":"W1003","presentation_id":"38929793","speakers":"Mike Lewis","title":"Invited Talk 3"},{"UID":"W1004","presentation_id":"38929794","speakers":"Evelina Fedorenko","title":"Invited Talk 4"}]
