[{"UID":"W802","presentation_id":"38929733","speakers":"Andrew S. Gordon, Institute for Creative Technologies, University of Southern California","title":"Toward Narrative Summarization of Simulated Battles"},{"UID":"W801","presentation_id":"38929732","speakers":"Angela Fan, INRIA Nancy and Facebook AI Research Paris","title":"LIGHT: Language in Games with Humans and Text"},{"UID":"W803","presentation_id":"38929734","speakers":"Mark A. Finlayson, Eminent Scholar Chaired Assistant Professor of Computer Science, Florida International University","title":"Toward Narrative NLP: The Utility of Adapting Models to the Narrative Case"},{"UID":"W807","presentation_id":"38929738","speakers":"Ted Underwood, Associate Professor of English, University of Illinois, Urbana-Champaign","title":"How is fiction predictable?"},{"UID":"W805","presentation_id":"38929736","speakers":"Kathleen McKeown, Henry and Gertrude Rothschild Professor of Computer Science, Columbia University","title":"Summarization of Stories and Events"},{"UID":"W804","presentation_id":"38929735","speakers":"Alexander G. Hauptmann, Language Technologies Institute, Carnegie Mellon University","title":"Video Analysis for Event Understanding"},{"UID":"W806","presentation_id":"38929737","speakers":"Ellen Riloff, Professor of Computer Science, University of Utah","title":"Affective Events and Narrative Understanding"},{"UID":"1","presentation_id":"38929739","speakers":"Andres Cremisini and Mark Finlayson","title":"New Insights into Cross-Document Event Coreference: Systematic Comparison and a Simplified Approach"},{"UID":"4","presentation_id":"38929740","speakers":"Ming-Chang Chiu, Tiantian Feng, Xiang Ren and Shrikanth Narayanan","title":"Screenplay Quality Assessment: Can We Predict Who Gets Nominated?"},{"UID":"7","presentation_id":"38929741","speakers":"Prithviraj Ammanabrolu, Wesley Cheung, Dan Tu, William Broniec and Mark Riedl","title":"Bringing Stories Alive: Generating Interactive Fiction Worlds"},{"UID":"9","presentation_id":"38929742","speakers":"Deya Banisakher, W. Victor Yarlott, Mohammed Aldawsari, Naphtali Rishe and Mark Finlayson","title":"Improving the Identification of the Discourse Function of News Article Paragraphs"},{"UID":"10","presentation_id":"38929743","speakers":"Samira Zad and Mark Finlayson","title":"Systematic Evaluation of a Framework for Unsupervised Emotion Recognition for Narrative Text"},{"UID":"11","presentation_id":"38929744","speakers":"Viet Dac Lai, Thien Huu Nguyen and Frank Dernoncourt","title":"Extensively Matching for Few-shot Learning Event Detection"},{"UID":"12","presentation_id":"38929745","speakers":"Tal August, Maarten Sap, Elizabeth Clark, Katharina Reinecke and Noah A. Smith","title":"Exploring the Effect of Author and Reader Identity in Online Story Writing: the STORIESINTHEWILD Corpus."},{"UID":"13","presentation_id":"38929746","speakers":"Anton Belyy and Benjamin Van Durme","title":"Script Induction as Association Rule Mining"},{"UID":"14","presentation_id":"38929747","speakers":"Joshua Eisenberg and Michael Sheriff","title":"Automatic extraction of personal events from dialogue"},{"UID":"15","presentation_id":"38929748","speakers":"Edward Kearns","title":"Annotating and quantifying narrative time disruptions in modernist and hypertext fiction"},{"UID":"16","presentation_id":"38929749","speakers":"Belen Saldias and Deb Roy","title":"Exploring aspects of similarity between spoken personal narratives by disentangling them into narrative clause types"},{"UID":"19","presentation_id":"38929750","speakers":"Swapnil Hingmire, Nitin Ramrakhiyani, Avinash Kumar Singh, Sangameshwar Patil, Girish Palshikar, Pushpak Bhattacharyya and Vasudeva Varma","title":"Extracting Message Sequence Charts from Hindi Narrative Text"},{"UID":"20","presentation_id":"38929751","speakers":"Swapna Somasundaran, Xianyang Chen and Michael Flor","title":"Emotion Arcs of Student Narratives"},{"UID":"24","presentation_id":"38929752","speakers":"Xiangyang Mou, Mo Yu, Bingsheng Yao, Chenghao Yang, Xiaoxiao Guo, Saloni Potdar and Hui Su","title":"Frustratingly Hard Evidence Retrieval for QA Over Books"},{"UID":"25","presentation_id":"38929753","speakers":"Effi Levi, Guy Mor, Shaul Shenhav and Tamir Sheafer","title":"CompRes: A Dataset for Narrative Structure in News"},{"UID":"27","presentation_id":"38929754","speakers":"Hai Wang and David McAllester","title":"On-The-Fly Information Retrieval Augmentation for Language Models"},{"UID":"28","presentation_id":"38929755","speakers":"Usman Shahid, Barbara Di Eugenio, Andrew Rojecki and Elena Zheleva","title":"Detecting and understanding moral biases in news"}]
