[{"card_image_alt_text":"A representative figure from paper main.403","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.403.png","content":{"abstract":"Parody is a figurative device used to imitate an entity for comedic or critical purposes and represents a widespread phenomenon in social media through many popular parody accounts. In this paper, we present the first computational study of parody. We introduce a new publicly available data set of tweets from real politicians and their corresponding parody accounts. We run a battery of supervised machine learning models for automatically detecting parody tweets with an emphasis on robustness by testing on tweets from accounts unseen in training, across different genders and across countries. Our results show that political parody tweets can be predicted with an accuracy up to 90%. Finally, we identify the markers of parody through a linguistic analysis. Beyond research in linguistics and political communication, accurately and automatically detecting parody is important to improving fact checking for journalists and analytics such as sentiment analysis through filtering out parodical utterances.","authors":["Antonios Maronikolakis","Danae Sánchez Villegas","Daniel Preotiuc-Pietro","Nikolaos Aletras"],"demo_url":"","keywords":["comedic purposes","computational parody","automatically tweets","fact checking"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.403.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.403","similar_paper_uids":["main.403","main.509","main.475","main.702","main.157"],"title":"Analyzing Political Parody in Social Media","tldr":"Parody is a figurative device used to imitate an entity for comedic or critical purposes and represents a widespread phenomenon in social media through many popular parody accounts. In this paper, we present the first computational study of parody. W...","track":"Computational Social Science and Social Media"},"forum":"main.403","id":"main.403","presentation_id":"38929044"},{"card_image_alt_text":"A representative figure from paper main.51","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.51.png","content":{"abstract":"The problem of comparing two bodies of text and searching for words that differ in their usage between them arises often in digital humanities and computational social science. This is commonly approached by training word embeddings on each corpus, aligning the vector spaces, and looking for words whose cosine distance in the aligned space is large. However, these methods often require extensive filtering of the vocabulary to perform well, and - as we show in this work - result in unstable, and hence less reliable, results. We propose an alternative approach that does not use vector space alignment, and instead considers the neighbors of each word. The method is simple, interpretable and stable. We demonstrate its effectiveness in 9 different setups, considering different corpus splitting criteria (age, gender and profession of tweet authors, time of tweet) and different languages (English, French and Hebrew).","authors":["Hila Gonen","Ganesh Jawahar","Djamé Seddah","Yoav Goldberg"],"demo_url":"","keywords":["computational science","word embeddings","vector alignment","vector spaces"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.51.pdf","sessions":[{"end_time":"Mon, 06 Jul 2020 07:00:00 GMT","session_name":"1B","start_time":"Mon, 06 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Mon, 06 Jul 2020 09:00:00 GMT","session_name":"2A","start_time":"Mon, 06 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.51","similar_paper_uids":["main.51","srw.39","main.337","main.276","main.260"],"title":"Simple, Interpretable and Stable Method for Detecting Words with Usage Change across Corpora","tldr":"The problem of comparing two bodies of text and searching for words that differ in their usage between them arises often in digital humanities and computational social science. This is commonly approached by training word embeddings on each corpus, a...","track":"Computational Social Science and Social Media"},"forum":"main.51","id":"main.51","presentation_id":"38929089"},{"card_image_alt_text":"A representative figure from paper main.50","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.50.png","content":{"abstract":"Discovering the stances of media outlets and influential people on current, debatable topics is important for social statisticians and policy makers. Many supervised solutions exist for determining viewpoints, but manually annotating training data is costly. In this paper, we propose a cascaded method that uses unsupervised learning to ascertain the stance of Twitter users with respect to a polarizing topic by leveraging their retweet behavior; then, it uses supervised learning based on user labels to characterize both the general political leaning of online media and of popular Twitter users, as well as their stance with respect to the target polarizing topic. We evaluate the model by comparing its predictions to gold labels from the Media Bias/Fact Check website, achieving 82.6% accuracy.","authors":["Peter Stefanov","Kareem Darwish","Atanas Atanasov","Preslav Nakov"],"demo_url":"","keywords":["supervised solutions","cascaded method","unsupervised learning","supervised learning"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.50.pdf","sessions":[{"end_time":"Mon, 06 Jul 2020 07:00:00 GMT","session_name":"1B","start_time":"Mon, 06 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Mon, 06 Jul 2020 09:00:00 GMT","session_name":"2A","start_time":"Mon, 06 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.50","similar_paper_uids":["main.50","main.352","main.723","main.509","main.305"],"title":"Predicting the Topical Stance and Political Leaning of Media using Tweets","tldr":"Discovering the stances of media outlets and influential people on current, debatable topics is important for social statisticians and policy makers. Many supervised solutions exist for determining viewpoints, but manually annotating training data is...","track":"Computational Social Science and Social Media"},"forum":"main.50","id":"main.50","presentation_id":"38929386"},{"card_image_alt_text":"A representative figure from paper main.405","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.405.png","content":{"abstract":"Social biases are encoded in word embeddings. This presents a unique opportunity to study society historically and at scale, and a unique danger when embeddings are used in downstream applications. Here, we investigate the extent to which publicly-available word embeddings accurately reflect beliefs about certain kinds of people as measured via traditional survey methods. We find that biases found in word embeddings do, on average, closely mirror survey data across seventeen dimensions of social meaning. However, we also find that biases in embeddings are much more reflective of survey data for some dimensions of meaning (e.g. gender) than others (e.g. race), and that we can be highly confident that embedding-based measures reflect survey data only for the most salient biases.","authors":["Kenneth Joseph","Jonathan Morgan"],"demo_url":"","keywords":["downstream applications","Word Embeddings","survey methods","embedding-based measures"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.405.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.405","similar_paper_uids":["main.405","main.488","main.431","main.487","main.484"],"title":"When do Word Embeddings Accurately Reflect Surveys on our Beliefs About People?","tldr":"Social biases are encoded in word embeddings. This presents a unique opportunity to study society historically and at scale, and a unique danger when embeddings are used in downstream applications. Here, we investigate the extent to which publicly-av...","track":"Computational Social Science and Social Media"},"forum":"main.405","id":"main.405","presentation_id":"38929278"},{"card_image_alt_text":"A representative figure from paper main.97","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.97.png","content":{"abstract":"Recently, many methods discover effective evidence from reliable sources by appropriate neural networks for explainable claim verification, which has been widely recognized. However, in these methods, the discovery process of evidence is nontransparent and unexplained. Simultaneously, the discovered evidence is aimed at the interpretability of the whole sequence of claims but insufficient to focus on the false parts of claims. In this paper, we propose a Decision Tree-based Co-Attention model (DTCA) to discover evidence for explainable claim verification. Specifically, we first construct Decision Tree-based Evidence model (DTE) to select comments with high credibility as evidence in a transparent and interpretable way. Then we design Co-attention Self-attention networks (CaSa) to make the selected evidence interact with claims, which is for 1) training DTE to determine the optimal decision thresholds and obtain more powerful evidence; and 2) utilizing the evidence to find the false parts in the claim. Experiments on two public datasets, RumourEval and PHEME, demonstrate that DTCA not only provides explanations for the results of claim verification but also achieves the state-of-the-art performance, boosting the F1-score by more than 3.11%, 2.41%, respectively.","authors":["Lianwei Wu","Yuan Rao","Yongqiang Zhao","Hao Liang","Ambreen Nazir"],"demo_url":"","keywords":["Explainable Verification","discovery evidence","claim verification","DTCA"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.97.pdf","sessions":[{"end_time":"Mon, 06 Jul 2020 09:00:00 GMT","session_name":"2A","start_time":"Mon, 06 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Mon, 06 Jul 2020 13:00:00 GMT","session_name":"3A","start_time":"Mon, 06 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.97","similar_paper_uids":["main.97","main.549","main.655","main.761","main.361"],"title":"DTCA: Decision Tree-based Co-Attention Networks for Explainable Claim Verification","tldr":"Recently, many methods discover effective evidence from reliable sources by appropriate neural networks for explainable claim verification, which has been widely recognized. However, in these methods, the discovery process of evidence is nontranspare...","track":"Computational Social Science and Social Media"},"forum":"main.97","id":"main.97","presentation_id":"38928738"},{"card_image_alt_text":"A representative figure from paper main.96","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.96.png","content":{"abstract":"In this paper, we demonstrate how code-switching patterns can be utilised to improve various downstream NLP applications. In particular, we encode various switching features to improve humour, sarcasm and hate speech detection tasks. We believe that this simple linguistic observation can also be potentially helpful in improving other similar NLP applications.","authors":["Srijan Bansal","Vishal Garimella","Ayush Suhane","Jasabanta Patro","Animesh Mukherjee"],"demo_url":"","keywords":["Downstream Applications","hate tasks","speech tasks","NLP applications"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.96.pdf","sessions":[{"end_time":"Mon, 06 Jul 2020 09:00:00 GMT","session_name":"2A","start_time":"Mon, 06 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Mon, 06 Jul 2020 13:00:00 GMT","session_name":"3A","start_time":"Mon, 06 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.96","similar_paper_uids":["main.96","main.663","main.764","demo.104","cl.1552"],"title":"Code-Switching Patterns Can Be an Effective Route to Improve Performance of Downstream NLP Applications: A Case Study of Humour, Sarcasm and Hate Speech Detection","tldr":"In this paper, we demonstrate how code-switching patterns can be utilised to improve various downstream NLP applications. In particular, we encode various switching features to improve humour, sarcasm and hate speech detection tasks. We believe that ...","track":"Computational Social Science and Social Media"},"forum":"main.96","id":"main.96","presentation_id":"38929119"},{"card_image_alt_text":"A representative figure from paper main.404","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.404.png","content":{"abstract":"A central concern in Computational Social Sciences (CSS) is fairness: where the role of NLP is to scale up text analysis to large corpora, the quality of automatic analyses should be as independent as possible of textual properties. We analyze the performance of a state-of-the-art neural model on the task of political claims detection (i.e., the identification of forward-looking statements made by political actors) and identify a strong frequency bias: claims made by frequent actors are recognized better. We propose two simple debiasing methods which mask proper names and pronouns during training of the model, thus removing personal information bias. We find that (a) these methods significantly decrease frequency bias while keeping the overall performance stable; and (b) the resulting models improve when evaluated in an out-of-domain setting.","authors":["Erenay Dayanik","Sebastian Padó"],"demo_url":"","keywords":["Masking Information","Fairer Detection","Computational Sciences","Computational"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.404.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.404","similar_paper_uids":["main.404","main.326","main.769","main.468","main.773"],"title":"Masking Actor Information Leads to Fairer Political Claims Detection","tldr":"A central concern in Computational Social Sciences (CSS) is fairness: where the role of NLP is to scale up text analysis to large corpora, the quality of automatic analyses should be as independent as possible of textual properties. We analyze the pe...","track":"Computational Social Science and Social Media"},"forum":"main.404","id":"main.404","presentation_id":"38928894"},{"card_image_alt_text":"A representative figure from paper main.406","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.406.png","content":{"abstract":"In an era where generating content and publishing it is so easy, we are bombarded with information and are exposed to all kinds of claims, some of which do not always rank high on the truth scale. This paper suggests that the key to a longer-term, holistic, and systematic approach to navigating this information pollution is capturing the provenance of claims. To do that, we develop a formal definition of provenance graph for a given natural language claim, aiming to understand where the claim may come from and how it has evolved. To construct the graph, we model provenance inference, formulated mainly as an information extraction task and addressed via a textual entailment model. We evaluate our approach using two benchmark datasets, showing initial success in capturing the notion of provenance and its effectiveness on the application of claim verification.","authors":["Yi Zhang","Zachary Ives","Dan Roth"],"demo_url":"","keywords":["Natural Claims","generating content","publishing","provenance inference"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.406.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.406","similar_paper_uids":["main.406","main.656","main.181","main.546","main.362"],"title":"“Who said it, and Why?” Provenance for Natural Language Claims","tldr":"In an era where generating content and publishing it is so easy, we are bombarded with information and are exposed to all kinds of claims, some of which do not always rank high on the truth scale. This paper suggests that the key to a longer-term, ho...","track":"Computational Social Science and Social Media"},"forum":"main.406","id":"main.406","presentation_id":"38928725"},{"card_image_alt_text":"A representative figure from paper main.474","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.474.png","content":{"abstract":"Many applications of computational social science aim to infer causal conclusions from non-experimental data. Such observational data often contains confounders, variables that influence both potential causes and potential effects. Unmeasured or latent confounders can bias causal estimates, and this has motivated interest in measuring potential confounders from observed text. For example, an individual’s entire history of social media posts or the content of a news article could provide a rich measurement of multiple confounders.Yet, methods and applications for this problem are scattered across different communities and evaluation practices are inconsistent.This review is the first to gather and categorize these examples and provide a guide to data-processing and evaluation decisions. Despite increased attention on adjusting for confounding using text, there are still many open problems, which we highlight in this paper.","authors":["Katherine Keith","David Jensen","Brendan O'Connor"],"demo_url":"","keywords":["Text Inference","computational science","causal conclusions","causal estimates"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.474.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.474","similar_paper_uids":["main.474","main.486","main.305","main.485","main.468"],"title":"Text and Causal Inference: A Review of Using Text to Remove Confounding from Causal Estimates","tldr":"Many applications of computational social science aim to infer causal conclusions from non-experimental data. Such observational data often contains confounders, variables that influence both potential causes and potential effects. Unmeasured or late...","track":"Computational Social Science and Social Media"},"forum":"main.474","id":"main.474","presentation_id":"38929140"},{"card_image_alt_text":"A representative figure from paper main.306","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.306.png","content":{"abstract":"In this paper, we study Multimodal Named Entity Recognition (MNER) for social media posts. Existing approaches for MNER mainly suffer from two drawbacks: (1) despite generating word-aware visual representations, their word representations are insensitive to the visual context; (2) most of them ignore the bias brought by the visual context. To tackle the first issue, we propose a multimodal interaction module to obtain both image-aware word representations and word-aware visual representations. To alleviate the visual bias, we further propose to leverage purely text-based entity span detection as an auxiliary module, and design a Unified Multimodal Transformer to guide the final predictions with the entity span predictions. Experiments show that our unified approach achieves the new state-of-the-art performance on two benchmark datasets.","authors":["Jianfei Yu","Jing Jiang","Li Yang","Rui Xia"],"demo_url":"","keywords":["Multimodal Recognition","Multimodal MNER","Multimodal","MNER"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.306.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 07:00:00 GMT","session_name":"6B","start_time":"Tue, 07 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.306","similar_paper_uids":["main.306","main.664","main.731","main.643","main.683"],"title":"Improving Multimodal Named Entity Recognition via Entity Span Detection with Unified Multimodal Transformer","tldr":"In this paper, we study Multimodal Named Entity Recognition (MNER) for social media posts. Existing approaches for MNER mainly suffer from two drawbacks: (1) despite generating word-aware visual representations, their word representations are insensi...","track":"Computational Social Science and Social Media"},"forum":"main.306","id":"main.306","presentation_id":"38929164"},{"card_image_alt_text":"A representative figure from paper main.307","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.307.png","content":{"abstract":"Previous works that integrated news articles to better process stock prices used a variety of neural networks to predict price movements. The textual and price information were both encoded in the neural network, and it is therefore difficult to apply this approach in situations other than the original framework of the notoriously hard problem of price prediction. In contrast, this paper presents a method to encode the influence of news articles through a vector representation of stocks called a stock embedding. The stock embedding is acquired with a deep learning framework using both news articles and price history. Because the embedding takes the operational form of a vector, it is applicable to other financial problems besides price prediction. As one example application, we show the results of portfolio optimization using Reuters & Bloomberg headlines, producing a capital gain 2.8 times larger than that obtained with a baseline method using only stock price data. This suggests that the proposed stock embedding can leverage textual financial semantics to solve financial prediction problems.","authors":["Xin Du","Kumiko Tanaka-Ishii"],"demo_url":"","keywords":["Stock Embeddings","Portfolio Optimization","financial problems","price prediction"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.307.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 07:00:00 GMT","session_name":"6B","start_time":"Tue, 07 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.307","similar_paper_uids":["main.307","main.331","demo.100","demo.58","main.77"],"title":"Stock Embeddings Acquired from News Articles and Price History, and an Application to Portfolio Optimization","tldr":"Previous works that integrated news articles to better process stock prices used a variety of neural networks to predict price movements. The textual and price information were both encoded in the neural network, and it is therefore difficult to appl...","track":"Computational Social Science and Social Media"},"forum":"main.307","id":"main.307","presentation_id":"38928848"},{"card_image_alt_text":"A representative figure from paper main.475","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.475.png","content":{"abstract":"Ideal point models analyze lawmakers' votes to quantify their political positions, or ideal points. But votes are not the only way to express a political position. Lawmakers also give speeches, release press statements, and post tweets. In this paper, we introduce the text-based ideal point model (TBIP), an unsupervised probabilistic topic model that analyzes texts to quantify the political positions of its authors. We demonstrate the TBIP with two types of politicized text data: U.S. Senate speeches and senator tweets. Though the model does not analyze their votes or political affiliations, the TBIP separates lawmakers by party, learns interpretable politicized topics, and infers ideal points close to the classical vote-based ideal points. One benefit of analyzing texts, as opposed to votes, is that the TBIP can estimate ideal points of anyone who authors political texts, including non-voting actors. To this end, we use it to study tweets from the 2020 Democratic presidential candidates. Using only the texts of their tweets, it identifies them along an interpretable progressive-to-moderate spectrum.","authors":["Keyon Vafa","Suresh Naidu","David Blei"],"demo_url":"","keywords":["Ideal models","Lawmakers","text-based model","TBIP"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.475.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.475","similar_paper_uids":["main.475","main.403","main.352","main.404","demo.120"],"title":"Text-Based Ideal Points","tldr":"Ideal point models analyze lawmakers' votes to quantify their political positions, or ideal points. But votes are not the only way to express a political position. Lawmakers also give speeches, release press statements, and post tweets. In this paper...","track":"Computational Social Science and Social Media"},"forum":"main.475","id":"main.475","presentation_id":"38929238"},{"card_image_alt_text":"A representative figure from paper main.305","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.305.png","content":{"abstract":"Trending topics in social media content evolve over time, and it is therefore crucial to understand social media users and their interpersonal communications in a dynamic manner. Here we study dynamic online conversation recommendation, to help users engage in conversations that satisfy their evolving interests. While most prior work assumes static user interests, our model is able to capture the temporal aspects of user interests, and further handle future conversations that are unseen during training time. Concretely, we propose a neural architecture to exploit changes of user interactions and interests over time, to predict which discussions they are likely to enter. We conduct experiments on large-scale collections of Reddit conversations, and results on three subreddits show that our model significantly outperforms state-of-the-art models that make a static assumption of user interests. We further evaluate on handling “cold start”, and observe consistently better performance by our model when considering various degrees of sparsity of user’s chatting history and conversation contexts. Lastly, analyses on our model outputs indicate user interest change, explaining the advantage and efficacy of our approach.","authors":["Xingshan Zeng","Jing Li","Lu Wang","Zhiming Mao","Kam-Fai Wong"],"demo_url":"","keywords":["Dynamic Recommendation","neural architecture","Trending topics","social users"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.305.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 07:00:00 GMT","session_name":"6B","start_time":"Tue, 07 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.305","similar_paper_uids":["main.305","cl.1508","main.390","main.8","main.392"],"title":"Dynamic Online Conversation Recommendation","tldr":"Trending topics in social media content evolve over time, and it is therefore crucial to understand social media users and their interpersonal communications in a dynamic manner. Here we study dynamic online conversation recommendation, to help users...","track":"Computational Social Science and Social Media"},"forum":"main.305","id":"main.305","presentation_id":"38928940"},{"card_image_alt_text":"A representative figure from paper main.477","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.477.png","content":{"abstract":"Understanding human preferences, along with cultural and social nuances, lives at the heart of natural language understanding. Concretely, we present a new task and corpus for learning alignments between machine and human preferences. Our newly introduced problem is concerned with predicting the preferable options from two sentences describing scenarios that may involve social, cultural, ethical, or moral situations. Our problem is framed as a natural language inference task with crowd-sourced preference votes by human players, obtained from a gamified voting platform. Along with the release of a new dataset of 200K data points, we benchmark several state-of-the-art neural models, along with BERT and friends on this task. Our experimental results show that current state-of-the-art NLP models still leave much room for improvement.","authors":["Yi Tay","Donovan Ong","Jie Fu","Alvin Chan","Nancy Chen","Anh Tuan Luu","Chris Pal"],"demo_url":"","keywords":["Machine Alignment","Understanding preferences","natural understanding","natural task"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.477.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.477","similar_paper_uids":["main.477","main.486","main.441","main.100","main.157"],"title":"Would you Rather? A New Benchmark for Learning Machine Alignment with Cultural Values and Social Preferences","tldr":"Understanding human preferences, along with cultural and social nuances, lives at the heart of natural language understanding. Concretely, we present a new task and corpus for learning alignments between machine and human preferences. Our newly intro...","track":"Computational Social Science and Social Media"},"forum":"main.477","id":"main.477","presentation_id":"38929305"},{"card_image_alt_text":"A representative figure from paper main.476","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.476.png","content":{"abstract":"While national politics often receive the spotlight, the overwhelming majority of legislation proposed, discussed, and enacted is done at the state level. Despite this fact, there is little awareness of the dynamics that lead to adopting these policies. In this paper, we take the first step towards a better understanding of these processes and the underlying dynamics that shape them, using data-driven methods. We build a new large-scale dataset, from multiple data sources, connecting state bills and legislator information, geographical information about their districts, and donations and donors' information. We suggest a novel task, predicting the legislative body's vote breakdown for a given bill, according to different criteria of interest, such as gender, rural-urban and ideological splits. Finally, we suggest a shared relational embedding model, representing the interactions between the text of the bill and the legislative context in which it is presented. Our experiments show that providing this context helps improve the prediction over strong text-based models.","authors":["Maryam Davoodi","Eric Waltenburg","Dan Goldwasser"],"demo_url":"","keywords":["data-driven methods","shared model","text-based models","national politics"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.476.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.476","similar_paper_uids":["main.476","main.463","main.633","main.679","main.724"],"title":"Understanding the Language of Political Agreement and Disagreement in Legislative Texts","tldr":"While national politics often receive the spotlight, the overwhelming majority of legislation proposed, discussed, and enacted is done at the state level. Despite this fact, there is little awareness of the dynamics that lead to adopting these polici...","track":"Computational Social Science and Social Media"},"forum":"main.476","id":"main.476","presentation_id":"38929431"},{"card_image_alt_text":"A representative figure from paper main.472","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.472.png","content":{"abstract":"Not all documents are equally important. Language processing is increasingly finding use as a supplement for questionnaires to assess psychological attributes of consenting individuals, but most approaches neglect to consider whether all documents of an individual are equally informative. In this paper, we present a novel model that uses message-level attention to learn the relative weight of users' social media posts for assessing their five factor personality traits. We demonstrate that models with message-level attention outperform those with word-level attention, and ultimately yield state-of-the-art accuracies for all five traits by using both word and message attention in combination with past approaches (an average increase in Pearson r of 2.5%). In addition, examination of the high-signal posts identified by our model provides insight into the relationship between language and personality, helping to inform future work.","authors":["Veronica Lynn","Niranjan Balasubramanian","H. Andrew Schwartz"],"demo_url":"","keywords":["User Prediction","Language processing","Hierarchical Modeling","Message-Level Attention"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.472.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.472","similar_paper_uids":["main.472","main.419","main.432","main.385","main.387"],"title":"Hierarchical Modeling for User Personality Prediction: The Role of Message-Level Attention","tldr":"Not all documents are equally important. Language processing is increasingly finding use as a supplement for questionnaires to assess psychological attributes of consenting individuals, but most approaches neglect to consider whether all documents of...","track":"Computational Social Science and Social Media"},"forum":"main.472","id":"main.472","presentation_id":"38929297"},{"card_image_alt_text":"A representative figure from paper main.473","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.473.png","content":{"abstract":"People vary in their ability to make accurate predictions about the future. Prior studies have shown that some individuals can predict the outcome of future events with consistently better accuracy. This leads to a natural question: what makes some forecasters better than others? In this paper we explore connections between the language people use to describe their predictions and their forecasting skill. Datasets from two different forecasting domains are explored: (1) geopolitical forecasts from Good Judgment Open, an online prediction forum and (2) a corpus of company earnings forecasts made by financial analysts. We present a number of linguistic metrics which are computed over text associated with people's predictions about the future including: uncertainty, readability, and emotion. By studying linguistic factors associated with predictions, we are able to shed some light on the approach taken by skilled forecasters. Furthermore, we demonstrate that it is possible to accurately predict forecasting skill using a model that is based solely on language. This could potentially be useful for identifying accurate predictions or potentially skilled forecasters earlier.","authors":["Shi Zong","Alan Ritter","Eduard Hovy"],"demo_url":"","keywords":["Measuring Skill","forecasting domains","geopolitical forecasts","corpus forecasts"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.473.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.473","similar_paper_uids":["main.473","main.162","main.387","main.213","main.679"],"title":"Measuring Forecasting Skill from Text","tldr":"People vary in their ability to make accurate predictions about the future. Prior studies have shown that some individuals can predict the outcome of future events with consistently better accuracy. This leads to a natural question: what makes some f...","track":"Computational Social Science and Social Media"},"forum":"main.473","id":"main.473","presentation_id":"38929057"},{"card_image_alt_text":"A representative figure from paper main.471","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.471.png","content":{"abstract":"Natural disasters (e.g., hurricanes) affect millions of people each year, causing widespread destruction in their wake. People have recently taken to social media websites (e.g., Twitter) to share their sentiments and feelings with the larger community. Consequently, these platforms have become instrumental in understanding and perceiving emotions at scale. In this paper, we introduce HurricaneEmo, an emotion dataset of 15,000 English tweets spanning three hurricanes: Harvey, Irma, and Maria. We present a comprehensive study of fine-grained emotions and propose classification tasks to discriminate between coarse-grained emotion groups. Our best BERT model, even after task-guided pre-training which leverages unlabeled Twitter data, achieves only 68% accuracy (averaged across all groups). HurricaneEmo serves not only as a challenging benchmark for models but also as a valuable resource for analyzing emotions in disaster-centric domains.","authors":["Shrey Desai","Cornelia Caragea","Junyi Jessy Li"],"demo_url":"","keywords":["Hurricane Disasters","Natural disasters","classification tasks","HurricaneEmo"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.471.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.471","similar_paper_uids":["main.471","main.372","main.288","main.342","demo.91"],"title":"Detecting Perceived Emotions in Hurricane Disasters","tldr":"Natural disasters (e.g., hurricanes) affect millions of people each year, causing widespread destruction in their wake. People have recently taken to social media websites (e.g., Twitter) to share their sentiments and feelings with the larger communi...","track":"Computational Social Science and Social Media"},"forum":"main.471","id":"main.471","presentation_id":"38929226"},{"card_image_alt_text":"A representative figure from paper main.470","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.470.png","content":{"abstract":"Throughout a conversation, participants make choices that can orient the flow of the interaction. Such choices are particularly salient in the consequential domain of crisis counseling, where a difficulty for counselors is balancing between two key objectives: advancing the conversation towards a resolution, and empathetically addressing the crisis situation. In this work, we develop an unsupervised methodology to quantify how counselors manage this balance. Our main intuition is that if an utterance can only receive a narrow range of appropriate replies, then its likely aim is to advance the conversation forwards, towards a target within that range. Likewise, an utterance that can only appropriately follow a narrow range of possible utterances is likely aimed backwards at addressing a specific situation within that range. By applying this intuition, we can map each utterance to a continuous orientation axis that captures the degree to which it is intended to direct the flow of the conversation forwards or backwards. This unsupervised method allows us to characterize counselor behaviors in a large dataset of crisis counseling conversations, where we show that known counseling strategies intuitively align with this axis. We also illustrate how our measure can be indicative of a conversation's progress, as well as its effectiveness.","authors":["Justine Zhang","Cristian Danescu-Niculescu-Mizil"],"demo_url":"","keywords":["Counseling Conversations","crisis counseling","unsupervised methodology","unsupervised method"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.470.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.470","similar_paper_uids":["main.470","main.184","main.635","main.568","main.183"],"title":"Balancing Objectives in Counseling Conversations: Advancing Forwards or Looking Backwards","tldr":"Throughout a conversation, participants make choices that can orient the flow of the interaction. Such choices are particularly salient in the consequential domain of crisis counseling, where a difficulty for counselors is balancing between two key o...","track":"Computational Social Science and Social Media"},"forum":"main.470","id":"main.470","presentation_id":"38928806"},{"card_image_alt_text":"A representative figure from paper main.308","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.308.png","content":{"abstract":"Predicting the political bias and the factuality of reporting of entire news outlets are critical elements of media profiling, which is an understudied but an increasingly important research direction. The present level of proliferation of fake, biased, and propagandistic content online has made it impossible to fact-check every single suspicious claim, either manually or automatically. Thus, it has been proposed to profile entire news outlets and to look for those that are likely to publish fake or biased content. This makes it possible to detect likely “fake news” the moment they are published, by simply checking the reliability of their source. From a practical perspective, political bias and factuality of reporting have a linguistic aspect but also a social context. Here, we study the impact of both, namely (i) what was written (i.e., what was published by the target medium, and how it describes itself in Twitter) vs. (ii) who reads it (i.e., analyzing the target medium’s audience on social media). We further study (iii) what was written about the target medium (in Wikipedia). The evaluation results show that what was written matters most, and we further show that putting all information sources together yields huge improvements over the current state-of-the-art.","authors":["Ramy Baly","Georgi Karadzhov","Jisun An","Haewoon Kwak","Yoan Dinkov","Ahmed Ali","James Glass","Preslav Nakov"],"demo_url":"","keywords":["News Profiling","media profiling","Text Analysis","political bias"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.308.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 07:00:00 GMT","session_name":"6B","start_time":"Tue, 07 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.308","similar_paper_uids":["main.308","main.332","main.404","srw.18","demo.35"],"title":"What Was Written vs. Who Read It: News Media Profiling Using Text Analysis and Social Media Context","tldr":"Predicting the political bias and the factuality of reporting of entire news outlets are critical elements of media profiling, which is an understudied but an increasingly important research direction. The present level of proliferation of fake, bias...","track":"Computational Social Science and Social Media"},"forum":"main.308","id":"main.308","presentation_id":"38929381"},{"card_image_alt_text":"A representative figure from paper main.353","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.353.png","content":{"abstract":"Trust is implicit in many online text conversations---striking up new friendships, or asking for tech support. But trust can be betrayed through deception. We study the language and dynamics of deception in the negotiation-based game Diplomacy, where seven players compete for world domination by forging and breaking alliances with each other. Our study with players from the Diplomacy community gathers 17,289 messages annotated by the sender for their intended truthfulness and by the receiver for their perceived truthfulness. Unlike existing datasets, this captures deception in long-lasting relationships, where the interlocutors strategically combine truth with lies to advance objectives. A model that uses power dynamics and conversational contexts can predict when a lie occurs nearly as well as human players.","authors":["Denis Peskov","Benny Cheng","Ahmed Elgohary","Joe Barrow","Cristian Danescu-Niculescu-Mizil","Jordan Boyd-Graber"],"demo_url":"","keywords":["language deception","deception","Trust","tech support"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.353.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.353","similar_paper_uids":["main.353","tacl.1834","demo.96","main.390","main.427"],"title":"It Takes Two to Lie: One to Lie, and One to Listen","tldr":"Trust is implicit in many online text conversations---striking up new friendships, or asking for tech support. But trust can be betrayed through deception. We study the language and dynamics of deception in the negotiation-based game Diplomacy, where...","track":"Computational Social Science and Social Media"},"forum":"main.353","id":"main.353","presentation_id":"38928719"},{"card_image_alt_text":"A representative figure from paper main.352","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.352.png","content":{"abstract":"Opinion prediction on Twitter is challenging due to the transient nature of tweet content and neighbourhood context. In this paper, we model users' tweet posting behaviour as a temporal point process to jointly predict the posting time and the stance label of the next tweet given a user's historical tweet sequence and tweets posted by their neighbours. We design a topic-driven attention mechanism to capture the dynamic topic shifts in the neighbourhood context. Experimental results show that the proposed model predicts both the posting time and the stance labels of future tweets more accurately compared to a number of competitive baselines.","authors":["Lixing Zhu","Yulan He","Deyu Zhou"],"demo_url":"","keywords":["Opinion Prediction","Neural Modelling","temporal process","topic-driven mechanism"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.352.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.352","similar_paper_uids":["main.352","main.509","main.50","main.48","main.298"],"title":"Neural Temporal Opinion Modelling for Opinion Prediction on Twitter","tldr":"Opinion prediction on Twitter is challenging due to the transient nature of tweet content and neighbourhood context. In this paper, we model users' tweet posting behaviour as a temporal point process to jointly predict the posting time and the stance...","track":"Computational Social Science and Social Media"},"forum":"main.352","id":"main.352","presentation_id":"38929198"},{"card_image_alt_text":"A representative figure from paper main.49","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.49.png","content":{"abstract":"Identifying controversial posts on social media is a fundamental task for mining public sentiment, assessing the influence of events, and alleviating the polarized views. However, existing methods fail to 1) effectively incorporate the semantic information from content-related posts; 2) preserve the structural information for reply relationship modeling; 3) properly handle posts from topics dissimilar to those in the training set. To overcome the first two limitations, we propose Topic-Post-Comment Graph Convolutional Network (TPC-GCN), which integrates the information from the graph structure and content of topics, posts, and comments for post-level controversy detection. As to the third limitation, we extend our model to Disentangled TPC-GCN (DTPC-GCN), to disentangle topic-related and topic-unrelated features and then fuse dynamically. Extensive experiments on two real-world datasets demonstrate that our models outperform existing methods. Analysis of the results and cases proves that our models can integrate both semantic and structural information with significant generalizability.","authors":["Lei Zhong","Juan Cao","Qiang Sheng","Junbo Guo","Ziang Wang"],"demo_url":"","keywords":["Controversy Detection","Identifying posts","mining sentiment","assessing events"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.49.pdf","sessions":[{"end_time":"Mon, 06 Jul 2020 07:00:00 GMT","session_name":"1B","start_time":"Mon, 06 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Mon, 06 Jul 2020 09:00:00 GMT","session_name":"2A","start_time":"Mon, 06 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.49","similar_paper_uids":["main.49","main.32","srw.5","main.338","main.358"],"title":"Integrating Semantic and Structural Information with Graph Convolutional Network for Controversy Detection","tldr":"Identifying controversial posts on social media is a fundamental task for mining public sentiment, assessing the influence of events, and alleviating the polarized views. However, existing methods fail to 1) effectively incorporate the semantic infor...","track":"Computational Social Science and Social Media"},"forum":"main.49","id":"main.49","presentation_id":"38929242"},{"card_image_alt_text":"A representative figure from paper main.48","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.48.png","content":{"abstract":"This paper solves the fake news detection problem under a more realistic scenario on social media. Given the source short-text tweet and the corresponding sequence of retweet users without text comments, we aim at predicting whether the source tweet is fake or not, and generating explanation by highlighting the evidences on suspicious retweeters and the words they concern. We develop a novel neural network-based model, Graph-aware Co-Attention Networks (GCAN), to achieve the goal. Extensive experiments conducted on real tweet datasets exhibit that GCAN can significantly outperform state-of-the-art methods by 16% in accuracy on average. In addition, the case studies also show that GCAN can produce reasonable explanations.","authors":["Yi-Ju Lu","Cheng-Te Li"],"demo_url":"","keywords":["Explainable Detection","fake problem","GCAN","Graph-aware Networks"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.48.pdf","sessions":[{"end_time":"Mon, 06 Jul 2020 07:00:00 GMT","session_name":"1B","start_time":"Mon, 06 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Mon, 06 Jul 2020 13:00:00 GMT","session_name":"3A","start_time":"Mon, 06 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.48","similar_paper_uids":["main.48","main.771","main.494","main.352","main.97"],"title":"GCAN: Graph-aware Co-Attention Networks for Explainable Fake News Detection on Social Media","tldr":"This paper solves the fake news detection problem under a more realistic scenario on social media. Given the source short-text tweet and the corresponding sequence of retweet users without text comments, we aim at predicting whether the source tweet ...","track":"Computational Social Science and Social Media"},"forum":"main.48","id":"main.48","presentation_id":"38928882"}]
