[{"card_image_alt_text":"A representative figure from paper main.371","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.371.png","content":{"abstract":"Generating a concise summary from a large collection of arguments on a given topic is an intriguing yet understudied problem. We propose to represent such summaries as a small set of talking points, termed key points, each scored according to its salience. We show, by analyzing a large dataset of crowd-contributed arguments, that a small number of key points per topic is typically sufficient for covering the vast majority of the arguments. Furthermore, we found that a domain expert can often predict these key points in advance. We study the task of argument-to-key point mapping, and introduce a novel large-scale dataset for this task. We report empirical results for an extensive set of experiments with this dataset, showing promising performance.","authors":["Roy Bar-Haim","Lilach Eden","Roni Friedman","Yoav Kantor","Dan Lahav","Noam Slonim"],"demo_url":"","keywords":["Automatic Summarization","argument-to-key mapping","Arguments","crowd-contributed arguments"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.371.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 14:00:00 GMT","session_name":"8B","start_time":"Tue, 07 Jul 2020 13:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.371","similar_paper_uids":["main.371","main.667","main.453","main.298","srw.5"],"title":"From Arguments to Key Points: Towards Automatic Argument Summarization","tldr":"Generating a concise summary from a large collection of arguments on a given topic is an intriguing yet understudied problem. We propose to represent such summaries as a small set of talking points, termed key points, each scored according to its sal...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.371","id":"main.371","presentation_id":"38929133"},{"card_image_alt_text":"A representative figure from paper main.370","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.370.png","content":{"abstract":"Cross-domain sentiment classification aims to address the lack of massive amounts of labeled data. It demands to predict sentiment polarity on a target domain utilizing a classifier learned from a source domain. In this paper, we investigate how to efficiently apply the pre-training language model BERT on the unsupervised domain adaptation. Due to the pre-training task and corpus, BERT is task-agnostic, which lacks domain awareness and can not distinguish the characteristic of source and target domain when transferring knowledge. To tackle these problems, we design a post-training procedure, which contains the target domain masked language model task and a novel domain-distinguish pre-training task. The post-training procedure will encourage BERT to be domain-aware and distill the domain-specific features in a self-supervised way. Based on this, we could then conduct the adversarial training to derive the enhanced domain-invariant features. Extensive experiments on Amazon dataset show that our model outperforms state-of-the-art methods by a large margin. The ablation study demonstrates that the remarkable improvement is not only from BERT but also from our method.","authors":["Chunning Du","Haifeng Sun","Jingyu Wang","Qi Qi","Jianxin Liao"],"demo_url":"","keywords":["Cross-Domain Analysis","Cross-domain classification","unsupervised adaptation","transferring knowledge"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.370.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.370","similar_paper_uids":["main.370","main.565","main.595","main.681","main.247"],"title":"Adversarial and Domain-Aware BERT for Cross-Domain Sentiment Analysis","tldr":"Cross-domain sentiment classification aims to address the lack of massive amounts of labeled data. It demands to predict sentiment polarity on a target domain utilizing a classifier learned from a source domain. In this paper, we investigate how to e...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.370","id":"main.370","presentation_id":"38928809"},{"card_image_alt_text":"A representative figure from paper main.372","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.372.png","content":{"abstract":"Understanding emotion expressed in language has a wide range of applications, from building empathetic chatbots to detecting harmful online behavior. Advancement in this area can be improved using large-scale datasets with a fine-grained typology, adaptable to multiple downstream tasks. We introduce GoEmotions, the largest manually annotated dataset of 58k English Reddit comments, labeled for 27 emotion categories or Neutral. We demonstrate the high quality of the annotations via Principal Preserved Component Analysis. We conduct transfer learning experiments with existing emotion benchmarks to show that our dataset generalizes well to other domains and different emotion taxonomies. Our BERT-based model achieves an average F1-score of .46 across our proposed taxonomy, leaving much room for improvement.","authors":["Dorottya Demszky","Dana Movshovitz-Attias","Jeongwoo Ko","Alan Cowen","Gaurav Nemade","Sujith Ravi"],"demo_url":"","keywords":["transfer learning","GoEmotions","Principal Analysis","BERT-based model"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.372.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.372","similar_paper_uids":["main.372","main.471","main.288","main.681","main.52"],"title":"GoEmotions: A Dataset of Fine-Grained Emotions","tldr":"Understanding emotion expressed in language has a wide range of applications, from building empathetic chatbots to detecting harmful online behavior. Advancement in this area can be improved using large-scale datasets with a fine-grained typology, ad...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.372","id":"main.372","presentation_id":"38929085"},{"card_image_alt_text":"A representative figure from paper main.399","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.399.png","content":{"abstract":"In argumentation, people state premises to reason towards a conclusion. The conclusion conveys a stance towards some target, such as a concept or statement. Often, the conclusion remains implicit, though, since it is self-evident in a discussion or left out for rhetorical reasons. However, the conclusion is key to understanding an argument and, hence, to any application that processes argumentation. We thus study the question to what extent an argument's conclusion can be reconstructed from its premises. In particular, we argue here that a decisive step is to infer a conclusion's target, and we hypothesize that this target is related to the premises' targets. We develop two complementary target inference approaches: one ranks premise targets and selects the top-ranked target as the conclusion target, the other finds a new conclusion target in a learned embedding space using a triplet neural network. Our evaluation on corpora from two domains indicates that a hybrid of both approaches is best, outperforming several strong baselines. According to human annotators, we infer a reasonably adequate conclusion target in 89% of the cases.","authors":["Milad Alshomary","Shahbaz Syed","Martin Potthast","Henning Wachsmuth"],"demo_url":"","keywords":["Target Inference","Argument Generation","argumentation","triplet network"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.399.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 10:00:00 GMT","session_name":"7B","start_time":"Tue, 07 Jul 2020 09:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.399","similar_paper_uids":["main.399","tacl.1843","main.139","main.370","main.757"],"title":"Target Inference in Argument Conclusion Generation","tldr":"In argumentation, people state premises to reason towards a conclusion. The conclusion conveys a stance towards some target, such as a concept or statement. Often, the conclusion remains implicit, though, since it is self-evident in a discussion or l...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.399","id":"main.399","presentation_id":"38928990"},{"card_image_alt_text":"A representative figure from paper main.373","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.373.png","content":{"abstract":"In a context of offensive content mediation on social media now regulated by European laws, it is important not only to be able to automatically detect sexist content but also to identify if a message with a sexist content is really sexist or is a story of sexism experienced by a woman. We propose: (1) a new characterization of sexist content inspired by speech acts theory and discourse analysis studies, (2) the first French dataset annotated for sexism detection, and (3) a set of deep learning experiments trained on top of a combination of several tweet’s vectorial representations (word embeddings, linguistic features, and various generalization strategies). Our results are encouraging and constitute a first step towards offensive content moderation.","authors":["Patricia Chiril","Véronique MORICEAU","Farah Benamara","Alda Mari","Gloria Origgi","Marlène Coulomb-Gully"],"demo_url":"","keywords":["offensive mediation","characterization content","sexism detection","offensive moderation"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.373.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 14:00:00 GMT","session_name":"8B","start_time":"Tue, 07 Jul 2020 13:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.373","similar_paper_uids":["main.373","srw.22","main.213","main.172","main.673"],"title":"He said \"who's gonna take care of your children when you are at ACL?\": Reported Sexist Acts are Not Sexist","tldr":"In a context of offensive content mediation on social media now regulated by European laws, it is important not only to be able to automatically detect sexist content but also to identify if a message with a sexist content is really sexist or is a st...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.373","id":"main.373","presentation_id":"38929101"},{"card_image_alt_text":"A representative figure from paper main.374","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.374.png","content":{"abstract":"Recently, sentiment analysis has seen remarkable advance with the help of pre-training approaches. However, sentiment knowledge, such as sentiment words and aspect-sentiment pairs, is ignored in the process of pre-training, despite the fact that they are widely used in traditional sentiment analysis approaches. In this paper, we introduce Sentiment Knowledge Enhanced Pre-training (SKEP) in order to learn a unified sentiment representation for multiple sentiment analysis tasks. With the help of automatically-mined knowledge, SKEP conducts sentiment masking and constructs three sentiment knowledge prediction objectives, so as to embed sentiment information at the word, polarity and aspect level into pre-trained sentiment representation. In particular, the prediction of aspect-sentiment pairs is converted into multi-label classification, aiming to capture the dependency between words in a pair. Experiments on three kinds of sentiment tasks show that SKEP significantly outperforms strong pre-training baseline, and achieves new state-of-the-art results on most of the test datasets. We release our code at https://github.com/baidu/Senta.","authors":["Hao Tian","Can Gao","Xinyan Xiao","Hao Liu","Bolei He","Hua Wu","Haifeng Wang","Feng Wu"],"demo_url":"","keywords":["Sentiment Pre-training","Sentiment Analysis","pre-training","sentiment tasks"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.374.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 14:00:00 GMT","session_name":"8B","start_time":"Tue, 07 Jul 2020 13:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.374","similar_paper_uids":["main.374","main.343","main.347","main.341","main.338"],"title":"SKEP: Sentiment Knowledge Enhanced Pre-training for Sentiment Analysis","tldr":"Recently, sentiment analysis has seen remarkable advance with the help of pre-training approaches. However, sentiment knowledge, such as sentiment words and aspect-sentiment pairs, is ignored in the process of pre-training, despite the fact that they...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.374","id":"main.374","presentation_id":"38929227"},{"card_image_alt_text":"A representative figure from paper main.514","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.514.png","content":{"abstract":"Affective tasks such as sentiment analysis, emotion classification, and sarcasm detection have been popular in recent years due to an abundance of user-generated data, accurate computational linguistic models, and a broad range of relevant applications in various domains. At the same time, many studies have highlighted the importance of text preprocessing, as an integral step to any natural language processing prediction model and downstream task. While preprocessing in affective systems is well-studied, preprocessing in word vector-based models applied to affective systems, is not. To address this limitation, we conduct a comprehensive analysis of the role of preprocessing techniques in affective analysis based on word vector models. Our analysis is the first of its kind and provides useful insights of the importance of each preprocessing technique when applied at the training phase, commonly ignored in pretrained word vector models, and/or at the downstream task phase.","authors":["Nastaran Babanejad","Ameeta Agrawal","Aijun An","Manos Papagelis"],"demo_url":"","keywords":["Word Learning","Affective Tasks","sentiment analysis","emotion classification"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.514.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.514","similar_paper_uids":["main.514","main.663","demo.101","main.364","cl.1547"],"title":"A Comprehensive Analysis of Preprocessing for Word Representation Learning in Affective Tasks","tldr":"Affective tasks such as sentiment analysis, emotion classification, and sarcasm detection have been popular in recent years due to an abundance of user-generated data, accurate computational linguistic models, and a broad range of relevant applicatio...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.514","id":"main.514","presentation_id":"38929338"},{"card_image_alt_text":"A representative figure from paper main.298","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.298.png","content":{"abstract":"State-of-the-art argument mining studies have advanced the techniques for predicting argument structures. However, the technology for capturing non-tree-structured arguments is still in its infancy. In this paper, we focus on non-tree argument mining with a neural model. We jointly predict proposition types and edges between propositions. Our proposed model incorporates (i) task-specific parameterization (TSP) that effectively encodes a sequence of propositions and (ii) a proposition-level biaffine attention (PLBA) that can predict a non-tree argument consisting of edges. Experimental results show that both TSP and PLBA boost edge prediction performance compared to baselines.","authors":["Gaku Morio","Hiroaki Ozaki","Terufumi Morishita","Yuta Koreeda","Kohsuke Yanai"],"demo_url":"","keywords":["Non-Tree Mining","predicting structures","edge prediction","Proposition-Level Parsing"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.298.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.298","similar_paper_uids":["main.298","main.352","main.14","main.749","main.134"],"title":"Towards Better Non-Tree Argument Mining: Proposition-Level Biaffine Parsing with Task-Specific Parameterization","tldr":"State-of-the-art argument mining studies have advanced the techniques for predicting argument structures. However, the technology for capturing non-tree-structured arguments is still in its infancy. In this paper, we focus on non-tree argument mining...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.298","id":"main.298","presentation_id":"38928683"},{"card_image_alt_text":"A representative figure from paper main.339","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.339.png","content":{"abstract":"The current aspect extraction methods suffer from boundary errors. In general, these errors lead to a relatively minor difference between the extracted aspects and the ground-truth. However, they hurt the performance severely. In this paper, we propose to utilize a pointer network for repositioning the boundaries. Recycling mechanism is used, which enables the training data to be collected without manual intervention. We conduct the experiments on the benchmark datasets SE14 of laptop and SE14-16 of restaurant. Experimental results show that our method achieves substantial improvements over the baseline, and outperforms state-of-the-art methods.","authors":["Zhenkai Wei","Yu Hong","Bowei Zou","Meng Cheng","Jianmin Yao"],"demo_url":"","keywords":["Boundary Repositioning","Aspect Extraction","Pointer Network","aspect methods"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.339.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 07:00:00 GMT","session_name":"6B","start_time":"Tue, 07 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.339","similar_paper_uids":["main.339","main.296","main.295","main.527","main.81"],"title":"Don't Eclipse Your Arts Due to Small Discrepancies: Boundary Repositioning with a Pointer Network for Aspect Extraction","tldr":"The current aspect extraction methods suffer from boundary errors. In general, these errors lead to a relatively minor difference between the extracted aspects and the ground-truth. However, they hurt the performance severely. In this paper, we propo...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.339","id":"main.339","presentation_id":"38928872"},{"card_image_alt_text":"A representative figure from paper main.338","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.338.png","content":{"abstract":"In the literature, existing studies always consider Aspect Sentiment Classification (ASC) as an independent sentence-level classification problem aspect by aspect, which largely ignore the document-level sentiment preference information, though obviously such information is crucial for alleviating the information deficiency problem in ASC. In this paper, we explore two kinds of sentiment preference information inside a document, i.e., contextual sentiment consistency w.r.t. the same aspect (namely intra-aspect sentiment consistency) and contextual sentiment tendency w.r.t. all the related aspects (namely inter-aspect sentiment tendency). On the basis, we propose a Cooperative Graph Attention Networks (CoGAN) approach for cooperatively learning the aspect-related sentence representation. Specifically, two graph attention networks are leveraged to model above two kinds of document-level sentiment preference information respectively, followed by an interactive mechanism to integrate the two-fold preference. Detailed evaluation demonstrates the great advantage of the proposed approach to ASC over the state-of-the-art baselines. This justifies the importance of the document-level sentiment preference information to ASC and the effectiveness of our approach capturing such information.","authors":["Xiao Chen","Changlong Sun","Jingjing Wang","Shoushan Li","Luo Si","Min Zhang","Guodong Zhou"],"demo_url":"","keywords":["Aspect Classification","ASC","independent problem","information problem"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.338.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 07:00:00 GMT","session_name":"6B","start_time":"Tue, 07 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 14:00:00 GMT","session_name":"8B","start_time":"Tue, 07 Jul 2020 13:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.338","similar_paper_uids":["main.338","main.293","main.374","main.295","main.341"],"title":"Aspect Sentiment Classification with Document-level Sentiment Preference Modeling","tldr":"In the literature, existing studies always consider Aspect Sentiment Classification (ASC) as an independent sentence-level classification problem aspect by aspect, which largely ignore the document-level sentiment preference information, though obvio...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.338","id":"main.338","presentation_id":"38929040"},{"card_image_alt_text":"A representative figure from paper main.512","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.512.png","content":{"abstract":"This paper studies the task of comparative preference classification (CPC). Given two entities in a sentence, our goal is to classify whether the first (or the second) entity is preferred over the other or no comparison is expressed at all between the two entities. Existing works either do not learn entity-aware representations well and fail to deal with sentences involving multiple entity pairs or use sequential modeling approaches that are unable to capture long-range dependencies between the entities. Some also use traditional machine learning approaches that do not generalize well. This paper proposes a novel Entity-aware Dependency-based Deep Graph Attention Network (ED-GAT) that employs a multi-hop graph attention over a dependency graph sentence representation to leverage both the semantic information from word embeddings and the syntactic information from the dependency graph to solve the problem. Empirical evaluation shows that the proposed model achieves the state-of-the-art performance in comparative preference classification.","authors":["Nianzu Ma","Sahisnu Mazumder","Hao Wang","Bing Liu"],"demo_url":"","keywords":["Comparative Classification","Entity-Aware Network","CPC","entity-aware representations"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.512.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.512","similar_paper_uids":["main.512","main.571","main.588","main.67","main.362"],"title":"Entity-Aware Dependency-Based Deep Graph Attention Network for Comparative Preference Classification","tldr":"This paper studies the task of comparative preference classification (CPC). Given two entities in a sentence, our goal is to classify whether the first (or the second) entity is preferred over the other or no comparison is expressed at all between th...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.512","id":"main.512","presentation_id":"38929219"},{"card_image_alt_text":"A representative figure from paper main.513","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.513.png","content":{"abstract":"We present OpinionDigest, an abstractive opinion summarization framework, which does not rely on gold-standard summaries for training. The framework uses an Aspect-based Sentiment Analysis model to extract opinion phrases from reviews, and trains a Transformer model to reconstruct the original reviews from these extractions. At summarization time, we merge extractions from multiple reviews and select the most popular ones. The selected opinions are used as input to the trained Transformer model, which verbalizes them into an opinion summary. OpinionDigest can also generate customized summaries, tailored to specific user needs, by filtering the selected opinions according to their aspect and/or sentiment. Automatic evaluation on Yelp data shows that our framework outperforms competitive baselines. Human studies on two corpora verify that OpinionDigest produces informative summaries and shows promising customization capabilities.","authors":["Yoshihiko Suhara","Xiaolan Wang","Stefanos Angelidis","Wang-Chiew Tan"],"demo_url":"","keywords":["Opinion Summarization","Automatic data","Human studies","OpinionDigest"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.513.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.513","similar_paper_uids":["main.513","main.461","main.582","main.175","main.296"],"title":"OpinionDigest: A Simple Framework for Opinion Summarization","tldr":"We present OpinionDigest, an abstractive opinion summarization framework, which does not rely on gold-standard summaries for training. The framework uses an Aspect-based Sentiment Analysis model to extract opinion phrases from reviews, and trains a T...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.513","id":"main.513","presentation_id":"38929096"},{"card_image_alt_text":"A representative figure from paper main.511","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.511.png","content":{"abstract":"We present an efficient annotation framework for argument quality, a feature difficult to be measured reliably as per previous work. A stochastic transitivity model is combined with an effective sampling strategy to infer high-quality labels with low effort from crowdsourced pairwise judgments. The model's capabilities are showcased by compiling Webis-ArgQuality-20, an argument quality corpus that comprises scores for rhetorical, logical, dialectical, and overall quality inferred from a total of 41,859 pairwise judgments among 1,271 arguments. With up to 93% cost savings, our approach significantly outperforms existing annotation procedures. Furthermore, novel insight into argument quality is provided through statistical analysis, and a new aggregation method to infer overall quality from individual quality dimensions is proposed.","authors":["Lukas Gienapp","Benno Stein","Matthias Hagen","Martin Potthast"],"demo_url":"","keywords":["argument quality","annotation framework","stochastic model","sampling strategy"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.511.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.511","similar_paper_uids":["main.511","main.371","main.667","main.738","main.116"],"title":"Efficient Pairwise Annotation of Argument Quality","tldr":"We present an efficient annotation framework for argument quality, a feature difficult to be measured reliably as per previous work. A stochastic transitivity model is combined with an effective sampling strategy to infer high-quality labels with low...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.511","id":"main.511","presentation_id":"38928731"},{"card_image_alt_text":"A representative figure from paper main.288","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.288.png","content":{"abstract":"In recent years, a new interesting task, called emotion-cause pair extraction (ECPE), has emerged in the area of text emotion analysis. It aims at extracting the potential pairs of emotions and their corresponding causes in a document. To solve this task, the existing research employed a two-step framework, which first extracts individual emotion set and cause set, and then pair the corresponding emotions and causes. However, such a pipeline of two steps contains some inherent flaws: 1) the modeling does not aim at extracting the final emotion-cause pair directly; 2) the errors from the first step will affect the performance of the second step. To address these shortcomings, in this paper we propose a new end-to-end approach, called ECPE-Two-Dimensional (ECPE-2D), to represent the emotion-cause pairs by a 2D representation scheme. A 2D transformer module and two variants, window-constrained and cross-road 2D transformers, are further proposed to model the interactions of different emotion-cause pairs. The 2D representation, interaction, and prediction are integrated into a joint framework. In addition to the advantages of joint modeling, the experimental results on the benchmark emotion cause corpus show that our approach improves the F1 score of the state-of-the-art from 61.28% to 68.89%.","authors":["Zixiang Ding","Rui Xia","Jianfei Yu"],"demo_url":"","keywords":["Prediction","emotion-cause extraction","text analysis","Joint Representation"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.288.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 14:00:00 GMT","session_name":"8B","start_time":"Tue, 07 Jul 2020 13:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.288","similar_paper_uids":["main.288","main.289","main.342","main.372","main.52"],"title":"ECPE-2D: Emotion-Cause Pair Extraction based on Joint Two-Dimensional Representation, Interaction and Prediction","tldr":"In recent years, a new interesting task, called emotion-cause pair extraction (ECPE), has emerged in the area of text emotion analysis. It aims at extracting the potential pairs of emotions and their corresponding causes in a document. To solve this ...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.288","id":"main.288","presentation_id":"38929456"},{"card_image_alt_text":"A representative figure from paper main.289","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.289.png","content":{"abstract":"Emotion-cause pair extraction aims to extract all emotion clauses coupled with their cause clauses from a given document. Previous work employs two-step approaches, in which the first step extracts emotion clauses and cause clauses separately, and the second step trains a classifier to filter out negative pairs. However, such pipeline-style system for emotion-cause pair extraction is suboptimal because it suffers from error propagation and the two steps may not adapt to each other well. In this paper, we tackle emotion-cause pair extraction from a ranking perspective, i.e., ranking clause pair candidates in a document, and propose a one-step neural approach which emphasizes inter-clause modeling to perform end-to-end extraction. It models the interrelations between the clauses in a document to learn clause representations with graph attention, and enhances clause pair representations with kernel-based relative position embedding for effective ranking. Experimental results show that our approach significantly outperforms the current two-step systems, especially in the condition of extracting multiple pairs in one document.","authors":["Penghui Wei","Jiahao Zhao","Wenji Mao"],"demo_url":"","keywords":["End-to-End Extraction","Emotion-cause extraction","ranking","Inter-Clause Modeling"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.289.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.289","similar_paper_uids":["main.289","main.288","main.342","main.580","main.61"],"title":"Effective Inter-Clause Modeling for End-to-End Emotion-Cause Pair Extraction","tldr":"Emotion-cause pair extraction aims to extract all emotion clauses coupled with their cause clauses from a given document. Previous work employs two-step approaches, in which the first step extracts emotion clauses and cause clauses separately, and th...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.289","id":"main.289","presentation_id":"38928827"},{"card_image_alt_text":"A representative figure from paper main.510","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.510.png","content":{"abstract":"Recent neural network models have achieved impressive performance on sentiment classification in English as well as other languages. Their success heavily depends on the availability of a large amount of labeled data or parallel corpus. In this paper, we investigate an extreme scenario of cross-lingual sentiment classification, in which the low-resource language does not have any labels or parallel corpus. We propose an unsupervised cross-lingual sentiment classification model named multi-view encoder-classifier (MVEC) that leverages an unsupervised machine translation (UMT) system and a language discriminator. Unlike previous language model (LM) based fine-tuning approaches that adjust parameters solely based on the classification error on training data, we employ the encoder-decoder framework of a UMT as a regularization component on the shared network parameters. In particular, the cross-lingual encoder of our model learns a shared representation, which is effective for both reconstructing input sentences of two languages and generating more representative views from the input for classification. Extensive experiments on five language pairs verify that our model significantly outperforms other models for 8/11 sentiment classification tasks.","authors":["Hongliang Fei","Ping Li"],"demo_url":"","keywords":["Cross-Lingual Classification","sentiment classification","unsupervised system","classification"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.510.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.510","similar_paper_uids":["main.510","main.421","main.658","main.554","srw.79"],"title":"Cross-Lingual Unsupervised Sentiment Classification with Multi-View Transfer Learning","tldr":"Recent neural network models have achieved impressive performance on sentiment classification in English as well as other languages. Their success heavily depends on the availability of a large amount of labeled data or parallel corpus. In this paper...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.510","id":"main.510","presentation_id":"38929309"},{"card_image_alt_text":"A representative figure from paper main.509","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.509.png","content":{"abstract":"In online debates, users express different levels of agreement/disagreement with one another's arguments and ideas. Often levels of agreement/disagreement are implicit in the text, and must be predicted to analyze collective opinions. Existing stance detection methods predict the polarity of a post's stance toward a topic or post, but don't consider the stance's degree of intensity. We introduce a new research problem, stance polarity and intensity prediction in response relationships between posts. This problem is challenging because differences in stance intensity are often subtle and require nuanced language understanding. Cyber argumentation research has shown that incorporating both stance polarity and intensity data in online debates leads to better discussion analysis. We explore five different learning models: Ridge-M regression, Ridge-S regression, SVR-RF-R, pkudblab-PIP, and T-PAN-PIP for predicting stance polarity and intensity in argumentation. These models are evaluated using a new dataset for stance polarity and intensity prediction collected using a cyber argumentation platform. The SVR-RF-R model performs best for prediction of stance polarity with an accuracy of 70.43% and intensity with RMSE of 0.596. This work is the first to train models for predicting a post's stance polarity and intensity in one combined value in cyber argumentation with reasonably good accuracy.","authors":["Joseph Sirrianni","Xiaoqing Liu","Douglas Adams"],"demo_url":"","keywords":["Cyber Argumentation","Detecting Polarity","online debates","intensity relationships"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.509.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 19:00:00 GMT","session_name":"9B","start_time":"Tue, 07 Jul 2020 18:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.509","similar_paper_uids":["main.509","main.157","main.352","main.403","main.287"],"title":"Agreement Prediction of Arguments in Cyber Argumentation for Detecting Stance Polarity and Intensity","tldr":"In online debates, users express different levels of agreement/disagreement with one another's arguments and ideas. Often levels of agreement/disagreement are implicit in the text, and must be predicted to analyze collective opinions. Existing stance...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.509","id":"main.509","presentation_id":"38929179"},{"card_image_alt_text":"A representative figure from paper main.290","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.290.png","content":{"abstract":"We present a simple but effective method for aspect identification in sentiment analysis. Our unsupervised method only requires word embeddings and a POS tagger, and is therefore straightforward to apply to new domains and languages. We introduce Contrastive Attention (CAt), a novel single-head attention mechanism based on an RBF kernel, which gives a considerable boost in performance and makes the model interpretable. Previous work relied on syntactic features and complex neural models. We show that given the simplicity of current benchmark datasets for aspect extraction, such complex models are not needed. The code to reproduce the experiments reported in this paper is available at https://github.com/clips/cat.","authors":["Stéphan Tulkens","Andreas van Cranenburgh"],"demo_url":"","keywords":["Embarrassingly Extraction","aspect identification","sentiment analysis","aspect extraction"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.290.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 10:00:00 GMT","session_name":"7B","start_time":"Tue, 07 Jul 2020 09:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.290","similar_paper_uids":["main.290","main.343","main.391","main.100","main.374"],"title":"Embarrassingly Simple Unsupervised Aspect Extraction","tldr":"We present a simple but effective method for aspect identification in sentiment analysis. Our unsupervised method only requires word embeddings and a POS tagger, and is therefore straightforward to apply to new domains and languages. We introduce Con...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.290","id":"main.290","presentation_id":"38929041"},{"card_image_alt_text":"A representative figure from paper main.291","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.291.png","content":{"abstract":"Stance detection is an important task, which aims to classify the attitude of an opinionated text towards a given target. Remarkable success has been achieved when sufficient labeled training data is available. However, annotating sufficient data is labor-intensive, which establishes significant barriers for generalizing the stance classifier to the data with new targets. In this paper, we proposed a Semantic-Emotion Knowledge Transferring (SEKT) model for cross-target stance detection, which uses the external knowledge (semantic and emotion lexicons) as a bridge to enable knowledge transfer across different targets. Specifically, a semantic-emotion heterogeneous graph is constructed from external semantic and emotion lexicons, which is then fed into a graph convolutional network to learn multi-hop semantic connections between words and emotion tags. Then, the learned semantic-emotion graph representation, which serves as prior knowledge bridging the gap between the source and target domains, is fully integrated into the bidirectional long short-term memory (BiLSTM) stance classifier by adding a novel knowledge-aware memory unit to the BiLSTM cell. Extensive experiments on a large real-world dataset demonstrate the superiority of SEKT against the state-of-the-art baseline methods.","authors":["Bowen Zhang","Min Yang","Xutao Li","Yunming Ye","Xiaofei Xu","Kuai Dai"],"demo_url":"","keywords":["Cross-target Detection","Stance detection","knowledge transfer","stance classifier"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.291.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.291","similar_paper_uids":["main.291","main.588","main.157","main.565","main.58"],"title":"Enhancing Cross-target Stance Detection with Transferable Semantic-Emotion Knowledge","tldr":"Stance detection is an important task, which aims to classify the attitude of an opinionated text towards a given target. Remarkable success has been achieved when sufficient labeled training data is available. However, annotating sufficient data is ...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.291","id":"main.291","presentation_id":"38929329"},{"card_image_alt_text":"A representative figure from paper main.293","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.293.png","content":{"abstract":"The aspect-based sentiment analysis (ABSA) consists of two conceptual tasks, namely an aspect extraction and an aspect sentiment classification. Rather than considering the tasks separately, we build an end-to-end ABSA solution. Previous works in ABSA tasks did not fully leverage the importance of syntactical information. Hence, the aspect extraction model often failed to detect the boundaries of multi-word aspect terms. On the other hand, the aspect sentiment classifier was unable to account for the syntactical correlation between aspect terms and the context words. This paper explores the grammatical aspect of the sentence and employs the self-attention mechanism for syntactical learning. We combine part-of-speech embeddings, dependency-based embeddings and contextualized embeddings (e.g. BERT, RoBERTa) to enhance the performance of the aspect extractor. We also propose the syntactic relative distance to de-emphasize the adverse effects of unrelated words, having weak syntactic connection with the aspect terms. This increases the accuracy of the aspect sentiment classifier. Our solutions outperform the state-of-the-art models on SemEval-2014 dataset in both two subtasks.","authors":["Minh Hieu Phan","Philip O. Ogunbona"],"demo_url":"","keywords":["Modelling Context","Aspect-based Analysis","aspect extraction","aspect classification"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.293.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.293","similar_paper_uids":["main.293","main.296","main.631","main.338","main.340"],"title":"Modelling Context and Syntactical Features for Aspect-based Sentiment Analysis","tldr":"The aspect-based sentiment analysis (ABSA) consists of two conceptual tasks, namely an aspect extraction and an aspect sentiment classification. Rather than considering the tasks separately, we build an end-to-end ABSA solution. Previous works in ABS...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.293","id":"main.293","presentation_id":"38928810"},{"card_image_alt_text":"A representative figure from paper main.287","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.287.png","content":{"abstract":"News editorials argue about political issues in order to challenge or reinforce the stance of readers with different ideologies. Previous research has investigated such persuasive effects for argumentative content. In contrast, this paper studies how important the style of news editorials is to achieve persuasion. To this end, we first compare content- and style-oriented classifiers on editorials from the liberal NYTimes with ideology-specific effect annotations. We find that conservative readers are resistant to NYTimes style, but on liberals, style even has more impact than content. Focusing on liberals, we then cluster the leads, bodies, and endings of editorials, in order to learn about writing style patterns of effective argumentation.","authors":["Roxanne El Baff","Henning Wachsmuth","Khalid Al Khatib","Benno Stein"],"demo_url":"","keywords":["News Argumentation","persuasion","content- classifiers","Persuasive Style"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.287.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.287","similar_paper_uids":["main.287","main.639","srw.17","main.331","main.673"],"title":"Analyzing the Persuasive Effect of Style in News Editorial Argumentation","tldr":"News editorials argue about political issues in order to challenge or reinforce the stance of readers with different ideologies. Previous research has investigated such persuasive effects for argumentative content. In contrast, this paper studies how...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.287","id":"main.287","presentation_id":"38929171"},{"card_image_alt_text":"A representative figure from paper main.292","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.292.png","content":{"abstract":"Cross-domain sentiment analysis has received significant attention in recent years, prompted by the need to combat the domain gap between different applications that make use of sentiment analysis. In this paper, we take a novel perspective on this task by exploring the role of external commonsense knowledge. We introduce a new framework, KinGDOM, which utilizes the ConceptNet knowledge graph to enrich the semantics of a document by providing both domain-specific and domain-general background concepts. These concepts are learned by training a graph convolutional autoencoder that leverages inter-domain concepts in a domain-invariant manner. Conditioning a popular domain-adversarial baseline method with these learned concepts helps improve its performance over state-of-the-art approaches, demonstrating the efficacy of our proposed framework.","authors":["Deepanway Ghosal","Devamanyu Hazarika","Abhinaba Roy","Navonil Majumder","Rada Mihalcea","Soujanya Poria"],"demo_url":"","keywords":["Sentiment Analysis","Cross-domain analysis","KinGDOM","Knowledge-Guided Adaptation"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.292.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.292","similar_paper_uids":["main.292","main.717","main.370","main.748","main.565"],"title":"KinGDOM: Knowledge-Guided DOMain Adaptation for Sentiment Analysis","tldr":"Cross-domain sentiment analysis has received significant attention in recent years, prompted by the need to combat the domain gap between different applications that make use of sentiment analysis. In this paper, we take a novel perspective on this t...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.292","id":"main.292","presentation_id":"38929234"},{"card_image_alt_text":"A representative figure from paper main.296","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.296.png","content":{"abstract":"Aspect terms extraction and opinion terms extraction are two key problems of fine-grained Aspect Based Sentiment Analysis (ABSA). The aspect-opinion pairs can provide a global profile about a product or service for consumers and opinion mining systems. However, traditional methods can not directly output aspect-opinion pairs without given aspect terms or opinion terms. Although some recent co-extraction methods have been proposed to extract both terms jointly, they fail to extract them as pairs. To this end, this paper proposes an end-to-end method to solve the task of Pair-wise Aspect and Opinion Terms Extraction (PAOTE). Furthermore, this paper treats the problem from a perspective of joint term and relation extraction rather than under the sequence tagging formulation performed in most prior works. We propose a multi-task learning framework based on shared spans, where the terms are extracted under the supervision of span boundaries. Meanwhile, the pair-wise relations are jointly identified using the span representations. Extensive experiments show that our model consistently outperforms state-of-the-art methods.","authors":["He Zhao","Longtao Huang","Rong Zhang","Quan Lu","Hui Xue"],"demo_url":"","keywords":["Pair-wise Extraction","Aspect extraction","opinion extraction","fine-grained Analysis"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.296.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.296","similar_paper_uids":["main.296","main.293","main.631","main.340","main.582"],"title":"SpanMlt: A Span-based Multi-Task Learning Framework for Pair-wise Aspect and Opinion Terms Extraction","tldr":"Aspect terms extraction and opinion terms extraction are two key problems of fine-grained Aspect Based Sentiment Analysis (ABSA). The aspect-opinion pairs can provide a global profile about a product or service for consumers and opinion mining system...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.296","id":"main.296","presentation_id":"38928713"},{"card_image_alt_text":"A representative figure from paper main.297","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.297.png","content":{"abstract":"Opinion role labeling (ORL) is a ﬁne-grained opinion analysis task and aims to answer “who expressed what kind of sentiment towards what?”. Due to the scarcity of labeled data, ORL remains challenging for data-driven methods. In this work, we try to enhance neural ORL models with syntactic knowledge by comparing and integrating different representations. We also propose dependency graph convolutional networks (DEPGCN) to encode parser information at different processing levels. In order to compensate for parser inaccuracy and reduce error propagation, we introduce multi-task learning (MTL) to train the parser and the ORL model simultaneously. We verify our methods on the benchmark MPQA corpus. The experimental results show that syntactic information is highly valuable for ORL, and our ﬁnal MTL model effectively boosts the F1 score by 9.29 over the syntax-agnostic baseline. In addition, we ﬁnd that the contributions from syntactic knowledge do not fully overlap with contextualized word representations (BERT). Our best model achieves 4.34 higher F1 score than the current state-ofthe-art.","authors":["Bo Zhang","Yue Zhang","Rui Wang","Zhenghua Li","Min Zhang"],"demo_url":"","keywords":["Syntax-Aware Labeling","Opinion labeling","ORL","opinion task"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.297.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 10:00:00 GMT","session_name":"7B","start_time":"Tue, 07 Jul 2020 09:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.297","similar_paper_uids":["main.297","main.268","main.591","main.247","main.629"],"title":"Syntax-Aware Opinion Role Labeling with Dependency Graph Convolutional Networks","tldr":"Opinion role labeling (ORL) is a ﬁne-grained opinion analysis task and aims to answer “who expressed what kind of sentiment towards what?”. Due to the scarcity of labeled data, ORL remains challenging for data-driven methods. In this work, we try to ...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.297","id":"main.297","presentation_id":"38929056"},{"card_image_alt_text":"A representative figure from paper main.295","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.295.png","content":{"abstract":"Aspect-based sentiment analysis aims to determine the sentiment polarity towards a specific aspect in online reviews. Most recent efforts adopt attention-based neural network models to implicitly connect aspects with opinion words. However, due to the complexity of language and the existence of multiple aspects in a single sentence, these models often confuse the connections. In this paper, we address this problem by means of effective encoding of syntax information. Firstly, we define a unified aspect-oriented dependency tree structure rooted at a target aspect by reshaping and pruning an ordinary dependency parse tree. Then, we propose a relational graph attention network (R-GAT) to encode the new tree structure for sentiment prediction. Extensive experiments are conducted on the SemEval 2014 and Twitter datasets, and the experimental results confirm that the connections between aspects and opinion words can be better established with our approach, and the performance of the graph attention network (GAT) is significantly improved as a consequence.","authors":["Kai Wang","Weizhou Shen","Yunyi Yang","Xiaojun Quan","Rui Wang"],"demo_url":"","keywords":["Aspect-based Analysis","encoding information","sentiment prediction","Relational Network"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.295.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.295","similar_paper_uids":["main.295","main.293","main.588","main.631","main.296"],"title":"Relational Graph Attention Network for Aspect-based Sentiment Analysis","tldr":"Aspect-based sentiment analysis aims to determine the sentiment polarity towards a specific aspect in online reviews. Most recent efforts adopt attention-based neural network models to implicitly connect aspects with opinion words. However, due to th...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.295","id":"main.295","presentation_id":"38928702"},{"card_image_alt_text":"A representative figure from paper main.294","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.294.png","content":{"abstract":"The main barrier to progress in the task of Formality Style Transfer is the inadequacy of training data. In this paper, we study how to augment parallel data and propose novel and simple data augmentation methods for this task to obtain useful sentence pairs with easily accessible models and systems. Experiments demonstrate that our augmented parallel data largely helps improve formality style transfer when it is used to pre-train the model, leading to the state-of-the-art results in the GYAFC benchmark dataset.","authors":["Yi Zhang","Tao Ge","Xu SUN"],"demo_url":"","keywords":["Parallel Augmentation","Formality Transfer","data methods","parallel data"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.294.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.294","similar_paper_uids":["main.294","main.639","main.169","srw.17","main.354"],"title":"Parallel Data Augmentation for Formality Style Transfer","tldr":"The main barrier to progress in the task of Formality Style Transfer is the inadequacy of training data. In this paper, we study how to augment parallel data and propose novel and simple data augmentation methods for this task to obtain useful senten...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.294","id":"main.294","presentation_id":"38929365"},{"card_image_alt_text":"A representative figure from paper main.342","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.342.png","content":{"abstract":"Emotion-cause pair extraction aims to extract all potential pairs of emotions and corresponding causes from unannotated emotion text. Most existing methods are pipelined framework, which identifies emotions and extracts causes separately, leading to a drawback of error propagation. Towards this issue, we propose a transition-based model to transform the task into a procedure of parsing-like directed graph construction. The proposed model incrementally generates the directed graph with labeled edges based on a sequence of actions, from which we can recognize emotions with the corresponding causes simultaneously, thereby optimizing separate subtasks jointly and maximizing mutual benefits of tasks interdependently. Experimental results show that our approach achieves the best performance, outperforming the state-of-the-art methods by 6.71% (p<0.01) in F1 measure.","authors":["Chuang Fan","Chaofa Yuan","Jiachen Du","Lin Gui","Min Yang","Ruifeng Xu"],"demo_url":"","keywords":["Emotion-Cause Extraction","error propagation","parsing-like construction","Transition-based Construction"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.342.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 07:00:00 GMT","session_name":"6B","start_time":"Tue, 07 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 10:00:00 GMT","session_name":"7B","start_time":"Tue, 07 Jul 2020 09:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.342","similar_paper_uids":["main.342","main.288","main.289","main.52","main.67"],"title":"Transition-based Directed Graph Construction for Emotion-Cause Pair Extraction","tldr":"Emotion-cause pair extraction aims to extract all potential pairs of emotions and corresponding causes from unannotated emotion text. Most existing methods are pipelined framework, which identifies emotions and extracts causes separately, leading to ...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.342","id":"main.342","presentation_id":"38928888"},{"card_image_alt_text":"A representative figure from paper main.632","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.632.png","content":{"abstract":"Predicting the persuasiveness of arguments has applications as diverse as writing assistance, essay scoring, and advertising. While clearly relevant to the task, the personal characteristics of an argument's source and audience have not yet been fully exploited toward automated persuasiveness prediction. In this paper, we model debaters' prior beliefs, interests, and personality traits based on their previous activity, without dependence on explicit user profiles or questionnaires. Using a dataset of over 60,000 argumentative discussions, comprising more than three million individual posts collected from the subreddit r/ChangeMyView, we demonstrate that our modeling of debater's characteristics enhances the prediction of argument persuasiveness as well as of debaters' resistance to persuasion.","authors":["Khalid Al Khatib","Michael Völske","Shahbaz Syed","Nikolay Kolyada","Benno Stein"],"demo_url":"","keywords":["Predicting Persuasiveness","Predicting arguments","writing assistance","essay scoring"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.632.pdf","sessions":[{"end_time":"Wed, 08 Jul 2020 09:00:00 GMT","session_name":"12A","start_time":"Wed, 08 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Wed, 08 Jul 2020 13:00:00 GMT","session_name":"13A","start_time":"Wed, 08 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.632","similar_paper_uids":["main.632","main.463","main.287","main.700","main.472"],"title":"Exploiting Personal Characteristics of Debaters for Predicting Persuasiveness","tldr":"Predicting the persuasiveness of arguments has applications as diverse as writing assistance, essay scoring, and advertising. While clearly relevant to the task, the personal characteristics of an argument's source and audience have not yet been full...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.632","id":"main.632","presentation_id":"38929405"},{"card_image_alt_text":"A representative figure from paper main.633","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.633.png","content":{"abstract":"An educated and informed consumption of media content has become a challenge in modern times. With the shift from traditional news outlets to social media and similar venues, a major concern is that readers are becoming encapsulated in \"echo chambers\" and may fall prey to fake news and disinformation, lacking easy access to dissenting views. We suggest a novel task aiming to alleviate some of these concerns -- that of detecting articles that most effectively counter the arguments -- and not just the stance -- made in a given text. We study this problem in the context of debate speeches. Given such a speech, we aim to identify, from among a set of speeches on the same topic and with an opposing stance, the ones that directly counter it. We provide a large dataset of 3,685 such speeches (in English), annotated for this relation, which hopefully would be of general interest to the NLP community. We explore several algorithms addressing this task, and while some are successful, all fall short of expert human performance, suggesting room for further research. All data collected during this work is freely available for research.","authors":["Matan Orbach","Yonatan Bilu","Assaf Toledo","Dan Lahav","Michal Jacovi","Ranit Aharonov","Noam Slonim"],"demo_url":"","keywords":["Detecting Speeches","Echo Chamber","echo chambers","opposing stance"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.633.pdf","sessions":[{"end_time":"Wed, 08 Jul 2020 09:00:00 GMT","session_name":"12A","start_time":"Wed, 08 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Wed, 08 Jul 2020 13:00:00 GMT","session_name":"13A","start_time":"Wed, 08 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.633","similar_paper_uids":["main.633","main.1","main.478","main.506","demo.58"],"title":"Out of the Echo Chamber: Detecting Countering Debate Speeches","tldr":"An educated and informed consumption of media content has become a challenge in modern times. With the shift from traditional news outlets to social media and similar venues, a major concern is that readers are becoming encapsulated in \"echo chambers...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.633","id":"main.633","presentation_id":"38928964"},{"card_image_alt_text":"A representative figure from paper main.341","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.341.png","content":{"abstract":"We propose SentiBERT, a variant of BERT that effectively captures compositional sentiment semantics. The model incorporates contextualized representation with binary constituency parse tree to capture semantic composition. Comprehensive experiments demonstrate that SentiBERT achieves competitive performance on phrase-level sentiment classification. We further demonstrate that the sentiment composition learned from the phrase-level annotations on SST can be transferred to other sentiment analysis tasks as well as related tasks, such as emotion classification tasks. Moreover, we conduct ablation studies and design visualization methods to understand SentiBERT. We show that SentiBERT is better than baseline approaches in capturing negation and the contrastive relation and model the compositional sentiment semantics.","authors":["Da Yin","Tao Meng","Kai-Wei Chang"],"demo_url":"","keywords":["Compositional Semantics","phrase-level classification","sentiment tasks","emotion tasks"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.341.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 07:00:00 GMT","session_name":"6B","start_time":"Tue, 07 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 13:00:00 GMT","session_name":"8A","start_time":"Tue, 07 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.341","similar_paper_uids":["main.341","main.374","main.195","main.204","main.338"],"title":"SentiBERT: A Transferable Transformer-Based Architecture for Compositional Sentiment Semantics","tldr":"We propose SentiBERT, a variant of BERT that effectively captures compositional sentiment semantics. The model incorporates contextualized representation with binary constituency parse tree to capture semantic composition. Comprehensive experiments d...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.341","id":"main.341","presentation_id":"38928884"},{"card_image_alt_text":"A representative figure from paper main.631","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.631.png","content":{"abstract":"Aspect term extraction aims to extract aspect terms from review texts as opinion targets for sentiment analysis. One of the big challenges with this task is the lack of sufficient annotated data. While data augmentation is potentially an effective technique to address the above issue, it is uncontrollable as it may change aspect words and aspect labels unexpectedly. In this paper, we formulate the data augmentation as a conditional generation task: generating a new sentence while preserving the original opinion targets and labels. We propose a masked sequence-to-sequence method for conditional augmentation of aspect term extraction. Unlike existing augmentation approaches, ours is controllable and allows to generate more diversified sentences. Experimental results confirm that our method alleviates the data scarcity problem significantly. It also effectively boosts the performances of several current models for aspect term extraction.","authors":["Kun Li","Chengbo Chen","Xiaojun Quan","Qing Ling","Yan Song"],"demo_url":"","keywords":["Conditional Augmentation","Aspect Extraction","sentiment analysis","data augmentation"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.631.pdf","sessions":[{"end_time":"Wed, 08 Jul 2020 09:00:00 GMT","session_name":"12A","start_time":"Wed, 08 Jul 2020 08:00:00 GMT","zoom_link":""},{"end_time":"Wed, 08 Jul 2020 13:00:00 GMT","session_name":"13A","start_time":"Wed, 08 Jul 2020 12:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.631","similar_paper_uids":["main.631","main.293","main.296","main.340","main.295"],"title":"Conditional Augmentation for Aspect Term Extraction via Masked Sequence-to-Sequence Generation","tldr":"Aspect term extraction aims to extract aspect terms from review texts as opinion targets for sentiment analysis. One of the big challenges with this task is the lack of sufficient annotated data. While data augmentation is potentially an effective te...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.631","id":"main.631","presentation_id":"38928808"},{"card_image_alt_text":"A representative figure from paper main.426","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.426.png","content":{"abstract":"Predicting how events induce emotions in the characters of a story is typically seen as a standard multi-label classification task, which usually treats labels as anonymous classes to predict. They ignore information that may be conveyed by the emotion labels themselves. We propose that the semantics of emotion labels can guide a model’s attention when representing the input story. Further, we observe that the emotions evoked by an event are often related: an event that evokes joy is unlikely to also evoke sadness. In this work, we explicitly model label classes via label embeddings, and add mechanisms that track label-label correlations both during training and inference. We also introduce a new semi-supervision strategy that regularizes for the correlations on unlabeled data. Our empirical evaluations show that modeling label semantics yields consistent benefits, and we advance the state-of-the-art on an emotion inference task.","authors":["Radhika Gaonkar","Heeyoung Kwon","Mohaddeseh Bastan","Niranjan Balasubramanian","Nathanael Chambers"],"demo_url":"","keywords":["Label Semantics","Predicting Reactions","multi-label task","training"],"paper_type":"Short","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.426.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 14:00:00 GMT","session_name":"8B","start_time":"Tue, 07 Jul 2020 13:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 21:00:00 GMT","session_name":"10A","start_time":"Tue, 07 Jul 2020 20:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.426","similar_paper_uids":["main.426","main.128","srw.123","demo.87","main.52"],"title":"Modeling Label Semantics for Predicting Emotional Reactions","tldr":"Predicting how events induce emotions in the characters of a story is typically seen as a standard multi-label classification task, which usually treats labels as anonymous classes to predict. They ignore information that may be conveyed by the emoti...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.426","id":"main.426","presentation_id":"38929370"},{"card_image_alt_text":"A representative figure from paper main.340","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/main.340.png","content":{"abstract":"Aspect-based sentiment analysis (ABSA) involves three subtasks, i.e., aspect term extraction, opinion term extraction, and aspect-level sentiment classification. Most existing studies focused on one of these subtasks only. Several recent researches made successful attempts to solve the complete ABSA problem with a unified framework. However, the interactive relations among three subtasks are still under-exploited. We argue that such relations encode collaborative signals between different subtasks. For example, when the opinion term is ``delicious'', the aspect term must be ``food'' rather than ``place''. In order to fully exploit these relations, we propose a Relation-Aware Collaborative Learning (RACL) framework which allows the subtasks to work coordinately via the multi-task learning and relation propagation mechanisms in a stacked multi-layer network. Extensive experiments on three real-world datasets demonstrate that RACL significantly outperforms the state-of-the-art methods for the complete ABSA task.","authors":["Zhuang Chen","Tieyun Qian"],"demo_url":"","keywords":["Unified Analysis","Aspect-based analysis","aspect extraction","opinion extraction"],"paper_type":"Long","pdf_url":"https://www.aclweb.org/anthology/2020.acl-main.340.pdf","sessions":[{"end_time":"Tue, 07 Jul 2020 07:00:00 GMT","session_name":"6B","start_time":"Tue, 07 Jul 2020 06:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 10:00:00 GMT","session_name":"7B","start_time":"Tue, 07 Jul 2020 09:00:00 GMT","zoom_link":""}],"share_url":"https://www.aclweb.org/anthology/2020.acl-main.340","similar_paper_uids":["main.340","main.296","main.293","main.631","main.295"],"title":"Relation-Aware Collaborative Learning for Unified Aspect-Based Sentiment Analysis","tldr":"Aspect-based sentiment analysis (ABSA) involves three subtasks, i.e., aspect term extraction, opinion term extraction, and aspect-level sentiment classification. Most existing studies focused on one of these subtasks only. Several recent researches m...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"main.340","id":"main.340","presentation_id":"38928854"},{"card_image_alt_text":"A representative figure from paper tacl.1843","card_image_path":"https://acl2020-public.s3.amazonaws.com/papers/tacl.1843.png","content":{"abstract":"Target-dependent sentiment analysis (TDSA) aims to classify the sentiment of a text towards a given target. The major challenge of this task lies in modeling the semantic relatedness between a target and its context sentence. This paper proposes a novel Target-Guided Structured Attention Network (TG-SAN), which captures target-related contexts for TDSA in a fine-to-coarse manner. Given a target and its context sentence, the proposed TG-SAN first identifies multiple semantic segments from the sentence using a target-guided structured attention mechanism. It then fuses the extracted segments based on their relatedness with the target for sentiment classification. We present comprehensive comparative experiments on three benchmarks with three major findings. Firstly, TG-SAN outperforms the state-of-the-art by up to 1.61% and 3.58% in terms of accuracy and Marco-F1 respectively. Secondly, it shows a strong advantage in determining the sentiment of a target when the context sentence contains multiple semantic segments. Lastly, the attention results produced by TG-SAN are highly interpretable as visualization results shown.","authors":["Ji Zhang","Chengyao Chen","Pengfei Liu","Chao He","Cane Wing-Ki Leung"],"demo_url":"","keywords":["Target-dependent Analysis","TDSA","sentiment classification","visualization"],"paper_type":"TACL","pdf_url":"https://www.mitpressjournals.org/doi/pdf/10.1162/tacl_a_00308","sessions":[{"end_time":"Tue, 07 Jul 2020 06:00:00 GMT","session_name":"6A","start_time":"Tue, 07 Jul 2020 05:00:00 GMT","zoom_link":""},{"end_time":"Tue, 07 Jul 2020 09:00:00 GMT","session_name":"7A","start_time":"Tue, 07 Jul 2020 08:00:00 GMT","zoom_link":""}],"share_url":"https://www.mitpressjournals.org/doi/10.1162/tacl_a_00308","similar_paper_uids":["tacl.1843","main.399","main.757","main.277","main.291"],"title":"Target-Guided Structured Attention Network for Target-dependent Sentiment Analysis","tldr":"Target-dependent sentiment analysis (TDSA) aims to classify the sentiment of a text towards a given target. The major challenge of this task lies in modeling the semantic relatedness between a target and its context sentence. This paper proposes a no...","track":"Sentiment Analysis, Stylistic Analysis, and Argument Mining"},"forum":"tacl.1843","id":"tacl.1843","presentation_id":"38929498"}]
